{"articles": {"page": 1, "totalResults": 26, "pages": 1, "results": [{"uri": "7960223953", "lang": "eng", "isDuplicate": false, "date": "2024-02-01", "time": "16:52:15", "dateTime": "2024-02-01T16:52:15Z", "dateTimePub": "2024-02-01T15:55:13Z", "dataType": "news", "sim": 0.6431372761726379, "url": "https://yalibnan.com/2022/07/31/lebanese-face-long-humiliating-queues-to-buy-bread/#comment-414297", "title": "Comment on Lebanese face long 'humiliating' queues to buy bread by Konto na Binance", "body": "Beirut- In bankrupt Lebanon, Khalil Mansour has to queue for hours every day just to buy bread for his family and some days he can't afford any.\n\nIn a country which once boasted the nickname \"Switzerland of the Middle East\" for its thriving banking sector before financial crisis hit in 2019, the chronic shortage of the staple of the Lebanese diet has been hard to take.\n\nLebanon defaulted on its national debt in 2020 and its currency has lost around 90 percent of its black market value.\n\nThe World Bank has branded the financial crisis one of the worst since the 19th century while the United Nations now considers four out five Lebanese to be living under the poverty line.\n\nFaced with demands from international creditors for painful reforms in return for the release of new aid, the embattled government has been forced to end subsidies on most essential goods -- although not so far on wheat.\n\nThe price of subsidised bread has gone up, although by less than if there were no subsidy, but bakeries have started rationing the staple.\n\nA bag of flat Arabic pitta-like bread now officially sells for 13,000 Lebanese pounds (43 US cents). On the black market it costs more than 30,000.\n\n\"Last week I went without bread for three days because I cannot afford to pay 30,000,\" said Mansour, 48.\n\nFor Mansour and most Lebanese, buying bread means standing for hours in long queues outside bakeries and sometimes, when their turn comes, the bakeries have run out of bread.\n\n\"Today I queued for three hours, yesterday two-and-a-half. What next?\" Mansour said on Friday outside a Beirut bakery.\n\n\"I have to feed my family. What else can I do?\" asked Mansour, who earns the equivalent of $50 a month working in a pastry shop.\n\nMost bakeries limit the sale of bread to one or two bags per customer, and each bag contains six flatbreads.\n\nSubsidised bread is often bought in large quantities and sold again on the black market by unscrupulous dealers.\n\n\"The queues have become worse over the past two weeks,\" said bakery owner Mohammed Mehdi. \"We are facing huge shortages.\"\n\nThe 49-year-old said the bakery business had become like the \"Wild West\". \"Some customers come armed with guns and knives,\" he complained.\n\nLebanese media carry frequent reports of fights breaking out at bakeries, and even shots fired by customers demanding more bread.\n\nIn Taalbaya, in eastern Lebanon, a customer stormed a bakery on Tuesday furious he could not buy more bread, one report said.\n\nThe client shoved an employee then ransacked the bakery, forcing the army to intervene, it added.\n\n\"What is happening is an insult... and it is even more difficult than the petrol shortage\" that gripped Lebanon last year, Mehdi said.\n\nLebanon imports 80 percent of its wheat from war-torn Ukraine, according to industry figures.\n\nBut the country's capacity to store wheat took a heavy blow when a deadly blast at Beirut port in August 2020 severely damaged the country's main grain silos.\n\nThe government and bakeries have traded blame for the bread shortage.\n\nBakeries accuse cash-strapped authorities of failing to provide enough subsidised flour.\n\nThe economy ministry denies the claim and has accused bakeries of hoarding subsidised flour to use in unsubsidised products such as sweets.\n\nAuthorities also claim that the presence in Lebanon of more than one million refugees from war-torn Syria is partly to blame for Lebanon's economic collapse.\n\nSome Lebanese have even gone as far as accusing Syrian refugees of buying subsidised bread to sell on the black market, fuelling resentment against the refugees and demands for them to go home.\n\nThis has prompted the UN refugee agency to voice its concern.\n\n\"Lebanon is witnessing an increase in tensions and incitement between different communities, leading to localised violence in the streets, including against refugees,\" the UNHCR warned on Friday.", "source": {"uri": "yalibnan.com", "dataType": "news", "title": "Ya Libnan"}, "authors": [], "image": null, "eventUri": "eng-9270409", "sentiment": -0.3333333333333334, "wgt": 1, "relevance": 1}, {"uri": "7960869878", "lang": "eng", "isDuplicate": false, "date": "2024-02-02", "time": "04:27:43", "dateTime": "2024-02-02T04:27:43Z", "dateTimePub": "2024-02-02T04:17:02Z", "dataType": "news", "sim": 0.7450980544090271, "url": "https://theprint.in/world/gilgit-baltistan-economic-coordination-committee-approves-wheat-subsidy-trims-ministries-budgets-after-protests/1950140/", "title": "Gilgit Baltistan: Economic Coordination Committee approves wheat subsidy, trims ministries' budgets after protests", "body": "The decision was taken during the meeting presided over by caretaker Finance Minister Shamshad Akhtar, who approved the transition from the London Inter-Bank Offer Rate (Libor) to the Secured Over Night Financing Rate (SOFR) in electricity contracts.\n\nPakistan's daily publication reported that the meeting discussed the issue of a sustainable plan for the price rationalisation of subsidised wheat in Gilgit-Baltistan. The people of the region have been protesting over the price increase for almost a month as the federal government scaled down the wheat subsidy.\n\nThe Gilgit Baltistan government had an understanding with the federal government to gradually increase the wheat price to Pakistan Rupee (PKR) 52 per kg to adjust the subsidy impact, but when it increased the rates to PKR 36 per kg from about PKR 20 per kg, protests erupted in the entire region. The withdrawal of full subsidy would mean an additional burden of more than Rs10bn on the GB government, which, in any case, relies on federal financing to run its affairs.\n\nThe Ministry of Finance explained that it could not extend subsidy out of budget due to strict IMF conditions. The only option was to make technical supplementary grants by diverting funds from other ministries having large part portfolios.\n\nThe ECC also approved a summary of the Ministry of Power regarding transition to the SOFR for interest calculation from Libor, which came to an end on June 30 last year in the international financial market. Under a decision of the UK's Financial Conduct Authority, the Libor system of benchmarking financial transactions has already expired on June 30 and replaced with the SOFR system with the approval of the Federal Reserve's Alternative Reference Rate Committee (ARRC), Dawn News reported.\n\nThe Power Division had contracts with foreign private contractors that required to transition to the new system, but Chinese investors had some reservations. The Power Division had proposed that project lenders of independent power producers and independent transmission companies should be allowed to adopt SOFR as a replacement for USD Libor on the basis of term SOFR plus applicable CAS and daily SOFR plus applicable CAS.\n\nThe meeting approved a series of supplementary grants. For example, it approved a supplementary grant of Rs38.856 million for Institutional Reforms Cell from the Cabinet Division and for import of Sahiwal Bull from Pakistan as semen donors for National Artificial Insemination Programme from the Ministry of Commerce.\n\nThe ECC approved a PKR 1.59 billion supplementary grant to the Ministry of Finance for rehabilitation of flood damaged rural roads in Khyber Pakhtunkhwa through counter value fund deposited under Japanese grant aid, and provision of clean drinking water in Model Areas UC 99, 100 and 101 Lahore through counter value fund deposited under Japanese grant aid. (ANI)", "source": {"uri": "theprint.in", "dataType": "news", "title": "ThePrint"}, "authors": [], "image": null, "eventUri": "eng-9269791", "sentiment": 0.1294117647058823, "wgt": 1, "relevance": 1}, {"uri": "7961077957", "lang": "eng", "isDuplicate": false, "date": "2024-02-02", "time": "07:45:37", "dateTime": "2024-02-02T07:45:37Z", "dateTimePub": "2024-02-02T07:45:21Z", "dataType": "news", "sim": 0.4705882370471954, "url": "https://interfax.com/newsroom/top-stories/99014/", "title": "Discover more", "body": "MOSCOW. Feb 2 (Interfax) - Most Ukrainian flour millers are continuing to raise purchase prices for food wheat, the cost of which increased by UAH100-200/tonne CPT in the past week, Ukrainian media reported, citing a statement from agriculture information and analytics agency APK-Inform.\n\n\"The supply of high quality grain remains insufficient and competition between processors and traders keeps growing, which continues to support prices,\" the agency said.\n\nAs of the beginning of this week, most processors are willing to pay UAH7,000-7,700/tonne CPT for Class 2 wheat, which is UAH100-200 more than a week earlier, the agency said. Some buyers are continuing to set prices at UAH6,600-6,800/tonne CPT, but it is difficult to get wheat at this price, APK-Inform added.\n\nIt was reported earlier that competition for high grade food wheat on Ukraine's domestic market intensified in January.", "source": {"uri": "interfax.com", "dataType": "news", "title": "interfax.com"}, "authors": [], "image": null, "eventUri": "eng-9264761", "sentiment": 0.03529411764705892, "wgt": 1, "relevance": 1}, {"uri": "7962594253", "lang": "eng", "isDuplicate": false, "date": "2024-02-03", "time": "08:09:05", "dateTime": "2024-02-03T08:09:05Z", "dateTimePub": "2024-02-03T08:08:22Z", "dataType": "news", "sim": 0.8117647171020508, "url": "https://www.aninews.in/news/world/asia/leaders-of-awami-action-committee-present-demands-for-ending-protests-in-gilgit-baltistan20240203133628/", "title": "Leaders of Awami Action Committee present demands for ending protests in Gilgit Baltistan", "body": "Gilgit Baltistan [PoK], February 3 (ANI): The leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThese demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nA leader from the AAC while participating in an ongoing protest on Friday said: \"We have presented certain demands in front of the administration. Out of the demands presented by us, four come under the jurisdiction of the provincial government and the rest come under the central government. However, even after two sessions of discussion, no response has been received from the government's side.\"\n\nIt must be noted here that a news piece published in Dawn dated February 2 claims that, amid continuous unrest in Gilgit-Baltistan for almost a month over a wheat price hike, the Economic Coordination Committee (ECC) of the Cabinet on Thursday agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries because of strict IMF conditions on subsidies.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nIn the past, lakhs of these subsidised bags of wheat have been smuggled to Afghanistan directly from Islamabad, ultimately resulting in a shortage of wheat. Hence, the AAC leaders have demanded that the quota of fifteen lakh bags of wheat that has been approved for GB, must be given to the people of GB anyhow.\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders said that \"the condition of Sehat Card (Health Card) holders is very unstable; hence, we demand that the card be restored in GB if it is being given to the people of POK. And we will not end our protests until the health card is reinstated\".\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB. (ANI)", "source": {"uri": "aninews.in", "dataType": "news", "title": "Asian News International (ANI)"}, "authors": [], "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20240203075831.jpg", "eventUri": "eng-9273679", "sentiment": -0.0980392156862745, "wgt": 1, "relevance": 1}, {"uri": "7962601499", "lang": "eng", "isDuplicate": false, "date": "2024-02-03", "time": "08:17:05", "dateTime": "2024-02-03T08:17:05Z", "dateTimePub": "2024-02-03T08:12:34Z", "dataType": "news", "sim": 0.7960784435272217, "url": "https://www.devdiscourse.com/article/international/2797639-leaders-of-awami-action-committee-present-demands-for-ending-protests-in-gilgit-baltistan", "title": "Leaders of Awami Action Committee present demands for ending protests in Gilgit Baltistan | International", "body": "The leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThe leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan. These demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nA leader from the AAC while participating in an ongoing protest on Friday said: \"We have presented certain demands in front of the administration. Out of the demands presented by us, four come under the jurisdiction of the provincial government and the rest come under the central government. However, even after two sessions of discussion, no response has been received from the government's side.\" It must be noted here that a news piece published in Dawn dated February 2 claims that, amid continuous unrest in Gilgit-Baltistan for almost a month over a wheat price hike, the Economic Coordination Committee (ECC) of the Cabinet on Thursday agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries because of strict IMF conditions on subsidies.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\". In the past, lakhs of these subsidised bags of wheat have been smuggled to Afghanistan directly from Islamabad, ultimately resulting in a shortage of wheat. Hence, the AAC leaders have demanded that the quota of fifteen lakh bags of wheat that has been approved for GB, must be given to the people of GB anyhow.\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back. The leaders said that \"the condition of Sehat Card (Health Card) holders is very unstable; hence, we demand that the card be restored in GB if it is being given to the people of POK. And we will not end our protests until the health card is reinstated\".\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB. (ANI)\n\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)", "source": {"uri": "devdiscourse.com", "dataType": "news", "title": "Devdiscourse"}, "authors": [], "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_02_2024_08_12_32_7969322.jpg?width=920&format=jpeg", "eventUri": "eng-9273679", "sentiment": -0.08235294117647063, "wgt": 1, "relevance": 1}, {"uri": "7962612624", "lang": "eng", "isDuplicate": false, "date": "2024-02-03", "time": "08:26:43", "dateTime": "2024-02-03T08:26:43Z", "dateTimePub": "2024-02-03T08:17:20Z", "dataType": "news", "sim": 0.7882353067398071, "url": "https://theprint.in/world/leaders-of-awami-action-committee-present-demands-for-ending-protests-in-gilgit-baltistan/1952029/", "title": "Leaders of Awami Action Committee present demands for ending protests in Gilgit Baltistan", "body": "These demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nA leader from the AAC while participating in an ongoing protest on Friday said: \"We have presented certain demands in front of the administration. Out of the demands presented by us, four come under the jurisdiction of the provincial government and the rest come under the central government. However, even after two sessions of discussion, no response has been received from the government's side.\"\n\nIt must be noted here that a news piece published in Dawn dated February 2 claims that, amid continuous unrest in Gilgit-Baltistan for almost a month over a wheat price hike, the Economic Coordination Committee (ECC) of the Cabinet on Thursday agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries because of strict IMF conditions on subsidies.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nIn the past, lakhs of these subsidised bags of wheat have been smuggled to Afghanistan directly from Islamabad, ultimately resulting in a shortage of wheat. Hence, the AAC leaders have demanded that the quota of fifteen lakh bags of wheat that has been approved for GB, must be given to the people of GB anyhow.\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders said that \"the condition of Sehat Card (Health Card) holders is very unstable; hence, we demand that the card be restored in GB if it is being given to the people of POK. And we will not end our protests until the health card is reinstated\".\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB. (ANI)", "source": {"uri": "theprint.in", "dataType": "news", "title": "ThePrint"}, "authors": [], "image": null, "eventUri": "eng-9273679", "sentiment": -0.0980392156862745, "wgt": 1, "relevance": 1}, {"uri": "7962630313", "lang": "eng", "isDuplicate": false, "date": "2024-02-03", "time": "08:45:39", "dateTime": "2024-02-03T08:45:39Z", "dateTimePub": "2024-02-03T08:20:18Z", "dataType": "news", "sim": 0.886274516582489, "url": "https://www.latestly.com/agency-news/world-news-leaders-of-awami-action-committee-present-demands-for-ending-protests-in-gilgit-baltistan-5735415.html", "title": "World News | Leaders of Awami Action Committee Present Demands for Ending Protests in Gilgit Baltistan | LatestLY", "body": "Gilgit Baltistan [PoK], February 3 (ANI): The leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThese demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nAlso Read | Groundhog Day 2024 Predictions by Punxsutawney Phil: Know Date, History and Significance Related to The US Observance (Watch Video).\n\nA leader from the AAC while participating in an ongoing protest on Friday said: \"We have presented certain demands in front of the administration. Out of the demands presented by us, four come under the jurisdiction of the provincial government and the rest come under the central government. However, even after two sessions of discussion, no response has been received from the government's side.\"\n\nIt must be noted here that a news piece published in Dawn dated February 2 claims that, amid continuous unrest in Gilgit-Baltistan for almost a month over a wheat price hike, the Economic Coordination Committee (ECC) of the Cabinet on Thursday agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries because of strict IMF conditions on subsidies.\n\nAlso Read | US: Mother of Michigan High School Shooter Who Killed Four Students Held Sex Parties in Hotels as Her Son Struggled Mentally, Says Report.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nIn the past, lakhs of these subsidised bags of wheat have been smuggled to Afghanistan directly from Islamabad, ultimately resulting in a shortage of wheat. Hence, the AAC leaders have demanded that the quota of fifteen lakh bags of wheat that has been approved for GB, must be given to the people of GB anyhow.\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders said that \"the condition of Sehat Card (Health Card) holders is very unstable; hence, we demand that the card be restored in GB if it is being given to the people of POK. And we will not end our protests until the health card is reinstated\".\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB. (ANI)\n\n(This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "eventUri": "eng-9273679", "sentiment": -0.0980392156862745, "wgt": 1, "relevance": 1}, {"uri": "7964273152", "lang": "eng", "isDuplicate": false, "date": "2024-02-04", "time": "17:45:34", "dateTime": "2024-02-04T17:45:34Z", "dateTimePub": "2024-02-04T17:32:53Z", "dataType": "news", "sim": 0.7686274647712708, "url": "https://theprint.in/world/gilgit-baltistan-millat-jafaria-leader-urges-people-organisations-to-fully-participate-in-sit-in-to-protest-against-wheat-price-hike/1953501/", "title": "Gilgit Baltistan: Millat Jafaria leader urges people, organisations to fully participate in sit-in to protest against wheat price hike", "body": "While addressing the gathering on Friday in Gilgit-Baltitstan, he said that he salutes the people of the region who have been protesting for their rights for many days in the bitter cold weather.\n\n\"I would request that the people of Gilgit-Baltistan, organisations, associations and people involved in various committees fully participate in the sit-ins and cooperate with the organisers,\" he said.\n\nMoreover, Al-Husseini said that the Pakistan government should negotiate with the leaders of the Awami Action Committee and find a solution to their problems.\n\nHe further added that, otherwise, they should resign and join the sit-in with them, according to Daily K2.\n\nAl-Husseini highlighted that, if needed, he will participate in the sit-in.\n\nThe Leader of Millat Jafaria said that the Charter of Demand of the Awami Action Committee is the voice of the heart of every individual in Gilgit-Baltistan for which serious steps are needed to be taken.\n\nFurthermore, he emphasised that the people of Nagar and Baltistan have solved the wheat problem through protests and the people of Gilgit also have to come out to fulfil their remaining demands, Daily K2 reported.\n\nThe leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThese demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB.\n\nNotably, after a month-long struggle and protests in Gilgit Baltistan over a wheat price hike, the Economic Coordination Committee (ECC) of the interim cabinet agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries given strict International Monetary Fund (IMF) conditions on subsidies, Dawn News reported. (ANI)", "source": {"uri": "theprint.in", "dataType": "news", "title": "ThePrint"}, "authors": [], "image": null, "eventUri": "eng-9270131", "sentiment": -0.1607843137254902, "wgt": 1, "relevance": 1}, {"uri": "7966586552", "lang": "eng", "isDuplicate": false, "date": "2024-02-06", "time": "07:50:01", "dateTime": "2024-02-06T07:50:01Z", "dateTimePub": "2024-02-06T07:48:01Z", "dataType": "news", "sim": 0, "url": "https://humnews.pk/pakistan/protests-in-gb-temporarily-halted-as-govt-meets-two-key-demands/", "title": "Protests in GB temporarily halted as govt meets two key demands - Hum NEWS", "body": "GILGIT: Prolonged protests in Gilgit-Baltistan (GB) have been temporarily halted for two to three weeks after the government addressed two out of fifteen demands put forth by the Awami Action Committee (ACC).\n\nThe Government of Gilgit-Baltistan announced on Monday that it would suspend the collection of newly introduced levies and fees outlined in the Gilgit-Baltistan Finance Act, 2023.\n\nThis decision aims to alleviate the burden on the public and support key sectors. However, only the fees and levies introduced for the first time in the Finance Act 2023 will be withheld.\n\nThis measure will remain in effect until necessary amendments are deliberated by the GB Cabinet and decided by the GB Assembly for the greater public interest.\n\nRead Also: Thousands march on Gilgit as protests over wheat price hike intensified\n\nThe ACC, which had staged a sit-in at Ittehad Chowk in Gilgit for over a month, had listed this as one of its 15 demands. Last month, the government also withdrew its notification to increase wheat prices up to Rs 36 per kg, addressing another demand.\n\nFollowing these developments, the AAC held an emergency meeting and decided to postpone the ongoing sit-in at Ittehad Chowk after 35 days.\n\nAAC leader Sher Nadir talking to HUM English stated that they agreed to the government's request for the time to address the remaining demands and plan to engage in a door-to-door campaign during this break to garner support and spread their message.\n\nHowever, Nadir emphasized their determination to intensify protests if the government fails to fulfill the outstanding demands, highlighting the legitimacy of their grievances and their unwillingness to compromise.\n\nThe remaining demands focus on resolving the power crisis, securing financial resources, asserting local ownership over land, enhancing governance, promoting economic growth, and improving educational and healthcare infrastructure, aiming for sustainable development and equitable rights for the people of Gilgit-Baltistan.", "source": {"uri": "humnews.pk", "dataType": "news", "title": "ہم نیوز"}, "authors": [{"uri": "tanveer_abbas@humnews.pk", "name": "Tanveer Abbas", "type": "author", "isAgency": false}], "image": "https://humnews.pk/wp-content/uploads/2024/02/Protests-in-Gb.jpg", "eventUri": null, "sentiment": 0.02745098039215677, "wgt": 1, "relevance": 1}, {"uri": "7968791231", "lang": "eng", "isDuplicate": false, "date": "2024-02-07", "time": "13:08:05", "dateTime": "2024-02-07T13:08:05Z", "dateTimePub": "2024-02-07T13:07:28Z", "dataType": "news", "sim": 0.6666666865348816, "url": "https://www.aninews.in/news/world/asia/gilgit-baltistan-awami-action-committee-postpones-sit-in-says-movement-not-over20240207183440/", "title": "Gilgit Baltistan: Awami Action Committee postpones sit-in, says movement not over", "body": "Gilgit Baltistan [PoK], February 7 (ANI): The Awami Action Committee has postponed for three weeks a week-long sit-in against the Gilgit-Baltistan authority in Pakistan-Occupied Kashmir (PoK) after negotiations with the Pakistan government, reported Pakistani vernacular media, the Daily K2.\n\nThe site of the sit-in, Ittehad Chowk, was also subsequently vacated, the publication reported.\n\nThe AAC, an alliance of political and religious parties and traders' unions had previously announced that it would continue protests till the government accepted their 15-point charter of demands.\n\nThe leaders of the AAC had on Friday declared specific demands for the provincial government of Gilgit Baltistan. These include the restoration of the subsidised wheat price at the 2022 level, suspension of the Finance Act 2022, withdrawal of various taxes, ensuring GB's share in the NFC award, and the provision of land ownership rights to locals.\n\nAAC Chief Coordinator, Advocate Ehsan Ali said that the movement has just started and more fronts have to be prepared. He further said that the AAC will prepare for a more organized movement in collaboration with all schools of thought political and social parties, and associations in all districts, according to Daily K2.\n\nAlo also extended thanks to those who cooperated wholeheartedly with the Committee and helped at the individual level.\n\nAAC Co-ordinator Fida Hussain said that the victory of the nation is yet to come, adding that a notification of the tax suspension has just been issued.\n\nThe Gilgit-Baltistan authority in Pakistan-Occupied Kashmir (PoK) had suspended tax collection after heavy protests over the government's decision to hike wheat prices and discontinue subsidies.\n\nCurrently, taxes are being levied under the Finance Act 2023, which has been suspended as per the orders of the Chief Minister and no tax will be applicable until the amendments in this act.\n\nAAC co-cordinator Hussain stressed that coordination work should be done to get the notification removed from the assembly and to work to promote peace and brotherhood, as reported by Daily K2.\n\nGhulam Abbas, a member of the negotiating committee, said that all kinds of tactics were adopted to weaken the movement of the Awami Action Committee, but the people's power has met its demands.\n\nHe also stressed that if the agreement is not implemented or if delaying tactics are used, the people will come out on the streets again and they are hopeful that the government will work and abide by the agreement, the vernacular media Daily K2 reported.\n\nHe further emphasised that if the declaration to suspend taxes is not implemented within three weeks, they will join the people with full force and a sit-in will be held at the same Ittehad Chowk.(ANI)", "source": {"uri": "aninews.in", "dataType": "news", "title": "Asian News International (ANI)"}, "authors": [], "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20240207112156.jpg", "eventUri": "eng-9282281", "sentiment": 0.192156862745098, "wgt": 1, "relevance": 1}, {"uri": "7968850083", "lang": "eng", "isDuplicate": false, "date": "2024-02-07", "time": "13:40:49", "dateTime": "2024-02-07T13:40:49Z", "dateTimePub": "2024-02-07T13:18:33Z", "dataType": "news", "sim": 0.6470588445663452, "url": "https://theprint.in/world/gilgit-baltistan-awami-action-committee-postpones-sit-in-says-movement-not-over/1957910/", "title": "Gilgit Baltistan: Awami Action Committee postpones sit-in, says movement not over", "body": "The site of the sit-in, Ittehad Chowk, was also subsequently vacated, the publication reported.\n\nThe AAC, an alliance of political and religious parties and traders' unions had previously announced that it would continue protests till the government accepted their 15-point charter of demands.\n\nThe leaders of the AAC had on Friday declared specific demands for the provincial government of Gilgit Baltistan. These include the restoration of the subsidised wheat price at the 2022 level, suspension of the Finance Act 2022, withdrawal of various taxes, ensuring GB's share in the NFC award, and the provision of land ownership rights to locals.\n\nAAC Chief Coordinator, Advocate Ehsan Ali said that the movement has just started and more fronts have to be prepared. He further said that the AAC will prepare for a more organized movement in collaboration with all schools of thought political and social parties, and associations in all districts, according to Daily K2.\n\nAlo also extended thanks to those who cooperated wholeheartedly with the Committee and helped at the individual level.\n\nAAC Co-ordinator Fida Hussain said that the victory of the nation is yet to come, adding that a notification of the tax suspension has just been issued.\n\nThe Gilgit-Baltistan authority in Pakistan-Occupied Kashmir (PoK) had suspended tax collection after heavy protests over the government's decision to hike wheat prices and discontinue subsidies.\n\nCurrently, taxes are being levied under the Finance Act 2023, which has been suspended as per the orders of the Chief Minister and no tax will be applicable until the amendments in this act.\n\nAAC co-cordinator Hussain stressed that coordination work should be done to get the notification removed from the assembly and to work to promote peace and brotherhood, as reported by Daily K2.\n\nGhulam Abbas, a member of the negotiating committee, said that all kinds of tactics were adopted to weaken the movement of the Awami Action Committee, but the people's power has met its demands.\n\nHe also stressed that if the agreement is not implemented or if delaying tactics are used, the people will come out on the streets again and they are hopeful that the government will work and abide by the agreement, the vernacular media Daily K2 reported.\n\nHe further emphasised that if the declaration to suspend taxes is not implemented within three weeks, they will join the people with full force and a sit-in will be held at the same Ittehad Chowk.(ANI)", "source": {"uri": "theprint.in", "dataType": "news", "title": "ThePrint"}, "authors": [], "image": null, "eventUri": "eng-9282281", "sentiment": 0.1294117647058823, "wgt": 1, "relevance": 1}, {"uri": "2024-02-249369224", "lang": "eng", "isDuplicate": false, "date": "2024-02-08", "time": "12:06:59", "dateTime": "2024-02-08T12:06:59Z", "dateTimePub": "2024-02-08T12:00:16Z", "dataType": "news", "sim": 0.5843137502670288, "url": "https://moderndiplomacy.eu/?p=70489", "title": "Pakistan's Discrimination Against Gilgit-Baltistan Invokes Mass Protests", "body": "Those residing in Gilgit-Baltistan and other parts of Kashmir under the control of Pakistan have carried out mass protests in freezing temperatures since late December. As a result, normal life has come to a complete standstill. The Awami Action Committee (AAC) are leading the protests that have spread across the region and have a list of demands that underscores the exploitation that the people of Gilgit-Baltistan face.\n\nThe demands of the protests' organizers concern the economic, social, and political needs of Gilgit-Baltistan (GB). They include the restoration of subsidized wheat prices at the 2022 level, the suspension of the Finance Act 2022, the withdrawal of various taxes, the replacement of the Gilgit-Baltistan assembly with a Constituent Assembly, the provision of free electricity from its own Diamer Bhasha dam, the cancelation of all mining leases given to non-locals and the provision of land ownership rights to locals, amongst others.\n\n\"Wheat, taxes and autonomy demands fuel strongest anti-Pakistan movement yet,\" according to Tara Kartha, a researcher at the Institute of Peace and Conflict Studies.\n\nLocals from the region have used the \"#GBWantAutonomy\" hashtag on social media platform X to express their requests from the government of Pakistan. Ijaz Shigri, an activist, wrote:\n\n\"We do not rule over our lands. No legislation for us in our assembly. Our taxes are not spent on our development. We do not own our mining and minerals. GBWantAutonomy.\"\n\nFatma Nur wrote on X on January 20:\n\n\"Skardu is witnessing the largest protest in #GilgitBaltistan history, with millions braving the bitter cold for 25 days..\n\n\"No wheat, No electricity, No Rights;\n\n\"Testament to the oppressed and deprived life they are living in so-called Azad Kashmir!\"\n\nThe newspaper Dawn further reported:\n\n\"Shops, business centers, restaurants, and trade activities remained suspended; inter-district and inter-provincial transportation remained close...\n\n\"Addressing the protesters, Ehsan Ali, the chief organizer of ACC, said that for the last seven decades, constitutional and legal rights for GB have been denied. He said successive governments in Islamabad failed to provide the due share of GB.\n\n\"Mr. Ali said the demand is not only the withdrawal of the subsidized wheat price hike but also other genuine issues that couldn't be solved in many decades.\"\n\nThe modern state of Pakistan was created through the 1947 British partition of India. Gilgit-Baltistan, also known as the Northern Areas, is a region controlled by Pakistan and has been the subject of a dispute between India and Pakistan since 1947.\n\nAfter Pakistan orchestrated an invasion of the former Princely State of Jammu and Kashmir (J&K) and carried out massacres against non-Muslims there in 1947, the state of J&K legally acceded to India by signing the \"instrument of accession\". According to this instrument, the entire state of Jammu and Kashmir, which also includes Gilgit-Baltistan, is part of India.\n\nPakistan, however, has continued to militarily occupy a portion of the state, which is now known as Pakistan Occupied Kashmir (PoK) and the Northern Areas or Gilgit-Baltistan.\n\nThe Gilgit-Baltistan region, whose capital is Muzaffarabad, today makes up the majority of the Pakistan-occupied Kashmir. According to the Hindu American Foundation,\n\n\"Pakistan refused to comply with the requirements of United Nations Security Council Resolution 47 and withdraw its military forces from the state, a necessary precondition before any plebiscite could be held. Since Pakistan never withdrew its military, it rendered the possibility of a plebiscite moot.\n\n\"In PoK, the Pakistani government has failed to provide basic rights and democratic representation to the Kashmiri people. Moreover, local Kashmiris are discriminated against, while Pakistanis are given preferential treatment.\"\n\nKriti M. Shah, a researcher on India and Pakistan, notes the lack of Gilgit-Baltistan's official status in Pakistan's constitution. The policies of Pakistan's government have violated GB residents such as economic exploitation, deliberately creating ethnic and sectarian tensions and forced demographic changes.\n\n\"Gilgit Baltistan's status is not mentioned in Pakistan's Constitution. Although they are part of the larger state of J&K and the classified Karachi Agreement of 1949 recognized that the region is part of the much smaller 'AJK [Azzad Jammu Kashmir]', the writ of Muzaffarabad has never been allowed to be implemented in the region. Despite numerous attempts by successive governments in Muzaffarabad to acquire administrative control over Gilgit-Baltistan, its petitions, resolutions, and pleas have been ignored.\n\n\"The Pakistan government, challenging the Supreme Court ruling in the Al-Jehad Trust case of 1993, stated that even the Supreme Court of Pakistan has no jurisdiction over the Northern Areas. Given its lack of constitutional status, Gilgit Baltistan does not have even a façade of self-governance. Unlike the other part of PoJK [Pakistan occupied Jammu Kashmir], Gilgit Baltistan continues to be governed by the federal government [of Pakistan].\"\n\nGilgit-Baltistan has historically comprised ethnic and sectarian groups who are currently minorities in Pakistan. Those are Shia Muslims, Ismailis, and Noor Bakshis. However, Pakistan's policies have provoked sectarian and ethnic discord. Shah explains:\n\n\"While the indigenous peoples of the region share common ethnic, linguistic, social and cultural ties with each other, the Pakistani state has over the decades provoked and fueled inter-ethnic strife to serve its own larger security interests. Indeed, sectarian consciousness in Gilgit Baltistan is a post-1947 phenomenon - a consequence of state apathy and desire to demolish the pluralistic nature of society. Furthermore, impoverished parents, having little choice because of lack of educational facilities, have often had to put their children in madaris where there is a possibility of them getting exposed to religious extremism.\"\n\nThe Hindu American Foundation explains how during the partition the demands of the Muslim League led to millions of Hindus and Sikhs fleeing from West Pakistan (modern Pakistan) and East Pakistan (Bangladesh) for India.\n\n\"Consequently, the number of Hindus in Pakistan declined from 15% in 1947 to 2% in 1951, 1.6% in 1998, and decreased by an additional 0.19% by 2017. Pakistan's widespread violation of the human rights of religious and ethnic minorities includes Hindus, Sikhs, Christians, Ahmaddiya Muslims, Shia Muslims, Baloch, Pashtun, and Sindhis.\"\n\nJust like other parts that are controlled by Pakistan, Gilgit-Baltistan has also undergone significant demographic changes at the hands of the government of Pakistan since 1947.\n\nPakistan settled Sunnis from other parts of the country in the region to dilute the Shia dominance of Gilgit-Baltistan, notes Shah.\n\n\"The government has also sponsored the settlement of a greater number of non-locals in the areas, which has damaged the social fabric and further created religious feuds and permanent rifts between communities in the region. The political vacuum in the region has promoted ethnic and religious narratives against each other; in turn, this has overshadowed people's demands for genuine political and social economic rights.\n\n\"There are reports that as of January 2001, the old population ratio of 1:4 (non-locals to locals) has changed to 3:4. Areas which were once dominated by Shia, such as Skardu and Gilgit, continue to witness an increase in non-Shia population.\"\n\nAs Abdul Hamid Khan, Chairman of the Balawaristan National Front (BNF) argues:\n\n\"'The Pakistani administration has been involved in efforts to alter the demographic profile of Pakistan-occupied Gilgit Baltistan, reducing the indigenous people to a minority. In the Gilgit and Skardu areas, large tracts of land have been allotted to non-locals. Other outsiders have purchased substantial stretches of land since they are economically better off than the locals. The rapid induction of Punjabi and Pashtun outsiders has created a sense of acute insecurity among the locals.'\"\n\nAll these factors, and particularly Gilgit-Baltistan's constitutional ambiguity, have facilitated Pakistan's economic exploitation of the region. Pakistan's refusal to heed the will of the people of Gilgit-Baltistan along with its systematic discrimination and other human rights abuses appear to be the cause of the ongoing mass protests.\n\nSince its 1947 founding, the actions of the State of Pakistan have led to instability, human rights violations, and violence in the region. The historic mass protests in Gilgit-Baltistan deserve to get more media coverage. Along with the protests, Pakistan's founding phase, its regional policies and what should be done regarding the country within international law to improve the stability in the region should also be further publicly discussed.", "source": {"uri": "moderndiplomacy.eu", "dataType": "news", "title": "Modern Diplomacy"}, "authors": [], "image": "https://moderndiplomacy.eu/wp-content/uploads/2024/02/Gilgit-Baltistan.jpg", "eventUri": "eng-9289723", "sentiment": -0.06666666666666665, "wgt": 1, "relevance": 1}, {"uri": "7970807318", "lang": "eng", "isDuplicate": false, "date": "2024-02-08", "time": "15:54:38", "dateTime": "2024-02-08T15:54:38Z", "dateTimePub": "2024-02-08T15:38:53Z", "dataType": "news", "sim": 0.6117647290229797, "url": "https://asianlite.com/2024/news/asia-diaspora-news/pakistan/gilgit-baltistan-deprived-of-basic-necessities/", "title": "Gilgit-Baltistan deprived of basic necessities - Asian News from UK", "body": "Rebellion against Pakistan is on the rise in Gilgit-Baltistan. The local people are questioning the right of Pakistan to divide and change the geographical structure of Gilgit-Baltistan... writes Muzaffar Khan Kashmiri\n\nGilgit-Baltistan is a part of Jammu and Kashmir, which is an unsettled area administered by Pakistan. The people of Gilgit-Baltistan have repeatedly demanded the government for the deprivation of basic facilities and from time to time they have come to the streets against the non-provision of basic facilities. Recently, according to reports, protest demonstrations were held in various districts of the region including Gilgit Astor, Diamar, Ghizar, Hunza.\n\nProtests were staged in Nagar, Skardu, Shagar, Kharmang and Ghanche districts on Saturday against wheat price hike and other grievances. Major roads including Karakoram Highway, Skardu Road, Ghazar Road looked deserted. Organizers say the only way to end the strike is for the government to accept their 15 demands. Awami Action Committee (ACC) had given the call for protest under Plan B as part of the protest movement that has been going on for the past one month.\n\nThe Awami Action Committee rejected the Gilgit-Baltistan (GB) government's decision to roll back the increase in the price of subsidized wheat. The Awami Action Committee claimed that the protest would be called off only after all 15 demands are met.\n\nAwami Action Committee representative Faizan Mir further said that important stakeholders were not consulted for this decision. The protesters said they would end the strike after the authorities meet their demands, including restoration of subsidized wheat prices at 2022 levels, suspension of the Finance Act 2022, rollback of various taxes, Ensuring GB's share of the NFC award, and provision of land ownership rights to indigenous peoples. All leases granted to outsiders for mineral exploration should be cancelled, 80% royalty of Diamer Bhasha Dam should be given to the people of GB under net hydel profit, electricity supply should be ensured to the residents of GB, electricity blockade should be removed, medical and engineering education system should be established. College for women to be established in the area.\n\nRepresentative Awami Action Committee Baltistan said that the protest will continue until the approval of the 15-point charter of demand. He said that the 34-day protest has been postponed for a few days.\n\nThe condition imposed by thes AAC to start negotiations with the government was linked to the issuance of a notification to withdraw the subsidized hike in wheat prices. He warned that protests would resume in Baltistan Division if all demands are not met. Organizers claimed that more people were joining the protest and announced sit-ins at Ittihad Chowk and other areas until their demands are met.\n\nIn Gilgit-Baltistan, no bus for college students will be seen plying on the road. You will see diesel generators outside shops but electricity will not be seen anywhere. Gilgit-Baltistan is facing hours of load-shedding due to which the local people are forced to live a precarious life in darkness.\n\nPamir Times, a popular newspaper of Gilgit-Baltistan, said in its recent report that Remote valleys and remote areas are either plunged into darkness and depend on diesel generators, kerosene or natural gas-burning lanterns and candles. Successive governments in the region have failed to develop a sustainable mechanism for power generation and distribution in the region. Knee-jerk reactions and populist rhetoric or tactics are often used to quell the angry masses, that too, only partially; without solving the deepening crisis Tourism in the region is enhanced only through promotion.\n\nBusinesses in the area, especially hotels, have been damaged due to power outages. Here you will find rows of private schools and private hospitals, but will not see government colleges, schools or hospitals. You will get ten deputy commissioners in ten districts but not ten lady doctors. The limitation is that even today there is no MRI machine in Baltistan region consisting of four districts. Post of Deputy Commissioner, Assistant Commissioner and SS are posted here. No more new posts are being made for Patwari and Police constables.\n\nToday people are deprived of all basic civil and political rights. If people protest, their leaders are illegally arrested under Pakistan's anti-terrorism laws. The so-called assembly of Gilgit-Baltistan does not discuss people's issues. The ruling elite allocates funds for luxuries and increases their salaries and allowances, but when it comes to public works, they say there is no budget. The government always fails to provide clean drinking water, electricity, health facilities, roads, wheat, pulses and education facilities.\n\nRebellion against Pakistan is on the rise in Gilgit-Baltistan. The local people are questioning the right of Pakistan to divide and change the geographical structure of Gilgit-Baltistan. The government of Pakistan should give its right to the people of Gilgit-Baltistan so that they can live a life with honor and dignity like the people of other countries.", "source": {"uri": "asianlite.com", "dataType": "news", "title": "Local News for British Asian and Indian Community in London"}, "authors": [], "image": "https://asianlite.com/wp-content/uploads/2024/02/GB-2.jpg", "eventUri": "eng-9287013", "sentiment": -0.2549019607843137, "wgt": 1, "relevance": 1}, {"uri": "7971176088", "lang": "eng", "isDuplicate": false, "date": "2024-02-08", "time": "20:49:27", "dateTime": "2024-02-08T20:49:27Z", "dateTimePub": "2024-02-08T20:49:06Z", "dataType": "news", "sim": 0, "url": "https://www.dtnpf.com/agriculture/web/ag/news/article/2024/02/08/february-wasde-shows-slightly-demand", "title": "February WASDE Shows Slightly Bearish Demand Changes for US, Only Minor Revisions in Brazil Crops", "body": "Traders were more curious as to what changes USDA might make to Brazil's soybean and corn production estimates following heat and dryness and early disappointing soy yield results. However, USDA chose to only drop Brazil soy production by 1 million metric ton (mmt) to 156 mmt compared to the pre-report Dow Jones estimate of 153 mmt. At 156 mmt, USDA is already 6.5 mmt higher than the Thursday morning soybean estimate from CONAB -- Brazil's answer to USDA. Other crop scouts and analysts are even more pessimistic than CONAB. USDA chose to lower Brazil's corn production close to Dow Jones' average estimate of 124.3 mmt, dropping it by 3 mmt to 124 mmt (4.88 bb). However, as in soybeans, CONAB's new corn estimate on Thursday morning was still more than 10 mmt (394 mb) lower than that, at just 113.7 mmt (4.47 bb). USDA, expected to increase the Argentine corn estimate, chose to leave that alone at 55 mmt (2.16 bb). It is likely that in future reports we could see further reductions in Brazil corn production.\n\nOther world changes for corn featured an offsetting decrease in Brazil corn exports to 52 mmt (2.04 bb) and an increase in Ukraine (23 mmt) corn exports, each by 2 mmt. Corn imports by the European Union were lowered by 500,000 metric tons (mt). Other changes were minor. In world ending stocks, traders were expecting a slight drop to 324 mmt, but USDA instead pegged that number at 322.1 mmt (12.68 bb) -- down 3.2 mmt from a month ago. That is still 22 mmt (866 mb) higher than last year due to Argentina's drought last year. Corn fell to another new contract low shortly after the report and closed with losses for the fifth time in the past six days.\n\nSOYBEANS\n\nTraders were expecting little change to the U.S. soybean balance sheet, although some traders were looking for a cut in U.S. exports due to the slow pace of sales and shipments. They got more than they bargained for, with USDA choosing to lower U.S. soy export sales by a hefty 35 mb to 1.720 bb. That translated right to the bottom line, raising the U.S. soy ending stocks by 35 mb to 315 mb. The change was certainly legitimate with U.S. soy sales down 19% from a year ago, and with the U.S. having lost the competitive edge to South America.\n\nAs mentioned above, on the world front, USDA has chosen to gradually lower Brazil soybean production compared to other forecasting outfits. The less-than-expected 1-mmt drop in production to 156 mmt (5.73 bb), is still 6.5 mmt (239 mb) above Thursday morning's new estimate from CONAB and close to 10 mmt (367 mb) higher than some other estimates from reputable firms. The Argentine crop was left alone at 50 mmt (1.83 bb). That is understandable with the crop in great shape until the extreme heat and dryness in the past few weeks. The ongoing wetter change in the Argentine weather pattern has a chance to revive that crop, and hence the decision to leave it alone. Perhaps the most notable change on Thursday was a revision in the 2022-23 Brazil soy crop, with USDA raising that 2 mmt to a record-large 162 mmt (5.95 bb) based on the enhanced shipping pace in the past year. That led to a 1.7 mmt higher carry-in stocks number for 2023-24. The higher stocks in both Brazil and the U.S. were responsible for the 1.4-mmt jump in world ending soy stocks at 116 mmt (4.26 bb) compared to 114.6 mmt in January. Overall, the report was slightly bearish for soybeans, and beans finished lower for the day.\n\nWHEAT\n\nOn the U.S. domestic side, with traders expecting wheat ending stocks to remain near unchanged, the 10-mb reduction in U.S. food use was a modest surprise and sent ending stocks up by the same amount to 658 mb. There were no other changes, with the season average wheat price left alone at $7.20 per bushel. There were only minor tweaks in the by-class category, with hard red winter ending stocks 5 mb higher at 279 mb, soft red winter wheat up by 4 mb, and white wheat ending stocks up by 1 mb.\n\nOn the global side for wheat, there were several minor changes, with the net effect a reduction of 700,000 mt in world ending stocks to 259.4 mmt (9.5 bb). That is the lowest since 2015-16. Argentina's wheat production rose by 500,000 mt to 15.5 mmt (569 mb), while Brazil had a 300,000-mt decline in production matched by the EU's 300,000 mt lower estimate. EU imports were increased by 1 mmt, while China's wheat imports dropped 500,000 mt to 12 mmt (441 mb). In the wheat export category, Brazil exports fell by 300,000 mt, Argentine and Australian exports rose by 500,000 mt each, while Ukraine's wheat exports rose by 1 mmt to 15 mmt (551 mb). The net impact to wheat was slightly bearish to mostly neutral, but wheat was under pressure before the report and slid to a sharply lower close by the end of the day.\n\nFINAL THOUGHTS\n\nIt seems obvious at this point that USDA is far more optimistic on Brazil corn and soy production prospects than many other crop scouts and analysts, and even Brazil's own answer to USDA -- CONAB. Granted, there is still plenty of growing weather yet to see, but it is realistic to assume that USDA, at some point, will be forced to lower production even more. With traders looking for only minor changes in the domestic supply and demand situation, perhaps the cut in soybean exports was a bit more than expected, but certainly justified. We will now go back to trading South American weather.\n\nFor Thursday, March corn finished down a penny at $4.33 1/4, March soybeans rose 4 1/2 cents to close at $11.93 1/2 on the heels of a dynamic bean oil rally, and Kansas City March wheat plunged to close 17 1/2 cents lower at $7.01, with reasons for the weakness on Thursday somewhat of a mystery. On another note, March soybean oil appears well on the way to a weekly reversal higher with one day left.", "source": {"uri": "dtnpf.com", "dataType": "news", "title": "DTN Progressive Farmer"}, "authors": [], "image": "https://www.dtnpf.com/mydtn-public-core-portlet/servlet/GetStoredImage?category=CMS&symbolicName=2024g08-wasde-report-review.png", "eventUri": null, "sentiment": -0.1215686274509804, "wgt": 1, "relevance": 1}, {"uri": "2024-02-258308694", "lang": "eng", "isDuplicate": false, "date": "2024-02-16", "time": "13:02:24", "dateTime": "2024-02-16T13:02:24Z", "dateTimePub": "2024-02-16T13:00:52Z", "dataType": "news", "sim": 0, "url": "https://mronline.org/2024/02/16/whats-driving-the-rise-in-grocery-prices-and-what-the-government-can-do-about-it/", "title": "What's driving the rise in grocery prices-and what the Government can do about it | MR Online", "body": "In recent years, American consumers have experienced a sharp rise in grocery prices. Although these price increases have plateaued in the last year, the cost of groceries remains a top concern for American families. In this report, we describe how grocery price inflation has affected different income groups, identify the key items driving grocery price inflation, outline some of the underlying causes of price increases, and offer policy recommendations to help reduce the chances of future grocery price spikes. As this report notes, these recommendations build on the steps the Biden administration already has taken to offset the financial impacts of higher grocery prices on lower-income families and to address some of the root causes of recent grocery price increases.\n\nDownload the full report here.\n\nConsumers feel the pinch of higher prices at the grocery store more regularly and universally than other expenses.\n\nThe widespread concern about grocery prices reflects two basic facts. First, nearly every household -- from the lowest income to the highest -- regularly buys groceries. Second, grocery prices have risen faster than the rate of inflation since the onset of the COVID-19 pandemic. While prices overall have risen by 19 percent in the last three years, families are now paying 25 percent more for groceries than they were before the pandemic.\n\nIn 2022 alone, American consumers saw the largest annual increase in grocery prices -- nearly 12 percent -- since 1978. That spike contributed to a 45 percent jump in food insecurity between 2021 and 2022. However, over the last year, grocery prices have largely plateaued.\n\nA number of grocery staples have come down from peak prices in 2022, providing some relief for families. For example, eggs, which skyrocketed to a peak of $4.82 per dozen, on average, in January 2023, were down to $2.51 per dozen by December 2023. Lettuce prices have come down significantly after high inflation in 2022 caused by poor growing conditions in California and Arizona. Domestic supply of lettuce has increased significantly over the past year, bringing prices down by nearly 17 percent.\n\nThe burden of higher grocery prices is not borne equally across the income spectrum. In 2022, consumers in the bottom quintile of the income spectrum spent 25 percent of their income on groceries, while those in the highest quintile spent under 3.5 percent. And roughly the bottom 40 percent of consumers spend more than 10 percent of their income on groceries.\n\nWhile high grocery prices affect the lowest-income families the most, food assistance expansions by the Biden administration have helped offset these price increases.\n\nWhile the rise in grocery prices places particular strain on lower-income families, the Biden administration has taken critical steps to increase food assistance for these families and offset this financial burden. The Supplemental Nutrition Assistance Program (SNAP, formerly the Food Stamp Program) provides cash-like benefits to roughly 42 million low-income Americans to supplement their grocery budget. Benefits are determined based on households' income and size, providing more benefits to poorer and larger families, where grocery budgets from wages and assets alone are stretched too thin.\n\nThe basis for SNAP benefits is the Thrifty Food Plan. The Thrifty Food Plan is determined by the U.S. Department of Agriculture (USDA), and it represents the lowest cost for purchasing and preparing an adequately nutritious diet. In 2021, the Biden administration overhauled the Thrifty Food Plan -- the first update in 15 years -- to more accurately reflect the true cost of a cost-effective grocery budget that meets nutritional requirements. As a result of this update, maximum SNAP benefits increased by 21 percent.\n\nIn addition to the Thrifty Food Plan update, Congress and the Biden administration temporarily increased SNAP benefits significantly as part of pandemic response legislation. Further, SNAP benefits are adjusted annually to reflect cost-of-living changes.\n\nThe cumulative impact of these changes increased the average per-person monthly SNAP benefit from $129 to $231 between 2019 and 2022. In February 2023, emergency SNAP benefit supplements ended, and as a result, average benefits decreased slightly to $212. Still, the overall rise in SNAP benefits between 2019 and 2023 has outpaced the rise in grocery costs for many beneficiaries. Maximum monthly benefits for a family of four have increased by 52 percent, from $642 to $973, and average monthly benefits for a family of four have increased by 54 percent from $465 to $713 since 2019. On average, the typical family that relies on SNAP has seen their benefits increase in the Biden administration at a significantly faster rate than grocery prices have risen.\n\nWhile these SNAP increases have helped stave off food insecurity and even more financial insecurity for the families eligible for the program, only approximately 15 percent of Americans qualify for SNAP. The income cutoff for SNAP eligibility for a four-person family is roughly $40,000. Further, despite large increases, SNAP benefits are still too low for many families, especially in urban areas. As a result, the recent rise in grocery prices continues to squeeze many lower- and middle-income Americans.\n\nMain Drivers in Grocery Inflation\n\nWhile the rise in grocery prices has been fairly broad-based in recent years, we find that five categories drove nearly 30 percent of grocery inflation: beef and veal; poultry; non-frozen non-carbonated juices and drinks; fresh fruits and vegetables; and snacks.\n\nA deeper look at these five categories reveals a host of causes for rapid price increases, from climate-related supply shocks to supply chain disruptions to expanding corporate profit margins. Addressing these underlying issues may not drive down prices in the short term, but can reduce the risks of future price spikes and create a more resilient, consumer-friendly food system.\n\nSupply Shocks\n\nBoth domestically and internationally, a number of recent acute shocks have reduced the supply of key inputs, helping drive up the price of certain grocery items.\n\nIn addition, one of the main drivers of poultry prices going up has been the recent outbreak of avian flu, a form of influenza that primarily targets bird species. Avian flu has long been detected throughout the world, but in 2022, the U.S. experienced the worst avian flu outbreak in history, affecting over 80 million chickens, turkeys, and other birds, and severely reducing the supply of poultry.\n\nJuice\n\nOver the past two years, there have been significant supply shocks to ingredients in juice and other non-carbonated beverages. Domestic orange production was down 12 percent last year. Florida is one of the main domestic producers of citrus, and the state has been disrupted by numerous supply shocks. In 2022, Hurricane Ian destroyed over $400 million worth of citrus plants and infrastructure in the state, causing the lowest citrus production since the Great Depression. In addition to climate-related shocks, the incurable citrus greening disease, which kills citrus plants, has also reduced the supply of citrus in places like Mexico, Brazil, and Florida.\n\nBeyond citrus fruits, sugar supply shocks have driven up beverage prices. Global sugar prices hit a decade-high in fall of 2023, largely due to drought conditions caused by El Niño, the extreme climate conditions brought on by higher Pacific Ocean water temperatures. While global sugar prices increased by nearly 70 percent between January 2021 and their peak in fall 2023, U.S. sugar prices also increased by more than 50 percent over the same period. Severe drought in Mexico has decreased sugar imports to the U.S. and increased our sugar exports to Mexico. Further, droughts in Louisiana and Texas have reduced the domestic sugar supply.\n\nFresh Produce\n\nClimate-related issues and disease outbreaks have also negatively affected fruit and vegetable production. As mentioned above, citrus greening disease is reducing citrus supply around the world. In addition, drought conditions have reduced domestic production. California produces over a third of the domestic supply of vegetables and nearly 75 percent of fruits, including strawberries, grapes, lettuce, tomatoes, carrots, blueberries, broccoli, and spinach. During the early months of 2023, the state faced an unprecedented amount of rain and flooding, which reduced the supply of fruits and vegetables.\n\nUpstream Commodity Prices\n\nKey inputs for many grocery staples have faced outsized price growth over the past few years, resulting in higher sticker prices.\n\nWheat\n\nThe war in Ukraine has played a significant role in rising wheat prices. Prior to Putin's invasion, Ukraine was the fifth largest exporter of wheat, contributing nearly 10 percent of global exports. Global wheat prices immediately rose with the onset of the escalation, reaching historic highs in May 2022. Beyond the initial escalation in February 2022, Russia has continued to restrict and attack Ukrainian export ports, keeping global wheat markets fragile.\n\nWhile forecasters anticipated severe and sustained supply shocks, Russia and Ukraine have been able to export more than expected. Russia is forecasted to export record levels of wheat this year, while Ukraine is exporting approximately 75 percent of pre-war levels. Wheat prices are significantly affected by speculation, driving prices up for consumers and driving down profits for farmers to make a quick buck for Wall Street traders.\n\nSugar\n\nBeyond recent supply shocks, U.S. raw sugar prices are typically about two times more than world raw sugar prices. The U.S. sugar program subsidizes domestic sugar producers -- making sugar farms substantially (between 24 and 54 percent) more profitable than other U.S. farms. The program allows sugar farmers to access low-rate loans from USDA, where sugar serves as collateral for the loans. USDA establishes the price per pound farmers will be paid for forfeited sugar, which effectively serves as a price floor for domestic sugar prices. For example, if USDA says they will pay 25 cents per pound of refined sugar, U.S. sugar refiners won't sell their sugar to food production companies for less than 25 cents. The Government Accountability Office estimates that the U.S. sugar program drives up domestic sugar prices and provides U.S. sugar farmers with approximately $2 billion in benefits each year.\n\nBeyond \"price guarantees,\" U.S. trade agreements limit sugar imports, allowing domestic producers and processors to charge higher prices for both raw and refined sugar. As a result of recent North American sugar supply issues, high-tariff sugar imports have increased, driving up sugar prices for domestic manufacturers that use sugar in other goods, like juice and snacks.\n\nOil\n\nVegetable oil prices have soared over the past two years. They are up 50 percent since 2019 (though down 33 percent since peaking in 2022). Several factors contribute to these high price increases. First, Indonesia, the world's biggest producer of palm oil, temporarily banned palm oil exports in April 2022 in an effort to bring down rising domestic food prices. Since lifting the ban after three weeks, they have continued to restrict exports. Further, soybean oil supply has been affected by droughts in Argentina and Brazil, two of the top global exporters, causing yields to hit a near-50-year low. Argentina has increased export taxes and has restricted exports since the escalation of the war in Ukraine.\n\nAdditionally, the global sunflower oil supply has dwindled as a result of the Ukraine war; Ukraine and Russia accounted for 75 percent of supply, which has been severely reduced because of the destruction of storage facilities, export blockades, and sanctions. Finally, Canada, the largest producer of canola oil, saw a 35 percent drop in yields due to drought conditions. This has created ripple effects, causing Canadian farmers to plant far fewer canola crops in favor of higher-margin wheat, thereby creating long-term supply shortages.\n\nWhile vegetable oils are generally highly interchangeable, nutritional values often vary, requiring manufacturers to update packaging. During the height of supply chain snarls, this meant weeks, if not months, of lead time, forcing manufacturers to stick to their original formulas and pay higher prices for input oils.\n\nCocoa\n\nGlobal cocoa supply has declined by one-third as the climate crisis ravages Ivory Coast and Ghana, the world's largest cocoa producers, which produce 60 percent of global supply. As a result, cocoa futures have doubled since January 2023. Excess rain is rotting cocoa trees, reducing and delaying harvests, and Wall Street speculators have driven prices up even further. Due to market regulations, cocoa prices are set at least a year in advance, meaning farmers are feeling the squeeze without actually feeling the windfalls trickle down. Large corporations are in a standoff with regulators, trying to negotiate lower prices, even as they raise prices for consumers and claim higher input costs.\n\nFertilizer\n\nGlobal fertilizer prices hit near-record levels in 2022 and remain elevated, in part due to Russia's war on Ukraine. Fertilizer accounts for nearly one-fifth of U.S. farm costs. Russia and Belarus are large global fertilizer suppliers, and export controls and international sanctions in the wake of Putin's war have affected the global market. Further, energy price increases have affected fertilizer supply. In Europe, for example, natural gas prices reduced ammonia production, and in China, coal price increases and electricity rationing reduced fertilizer production plants' output. Reliance on Russia and China for fertilizer nutrients poses long-term risks to the resilience of fertilizer supply chains.\n\nCorporate Profiteering\n\nAlthough supply chain issues and increased production costs have played a role in rising grocery prices, certain manufacturing and retail corporations have also taken advantage of the recent global inflation surge to raise their profit margins. These trends are most notable in more concentrated industries.\n\nMeat Processing\n\nThe meat processing industry in the United States is highly concentrated, with four companies controlling between 55 percent and 85 percent of the market for beef, poultry, and pork processing. In 2021 and 2022, the industry saw wholesale prices grow much more rapidly than input prices. For example, the meatpacker Tyson Foods achieved record margins. In a 2021 earnings call, Tyson noted that its pricing actions \"more than offset the higher COGS [cost of goods sold].\"\n\nBeverages\n\nThough input costs have gone up for beverage producers, top companies in the beverage industry hiked prices beyond the increase of their input costs to expand their profit margins. Both PepsiCo, the parent company of Tropicana and Gatorade, and Coca-Cola, the parent company of Minute Maid and Simply -- which together control nearly 30 percent of the juice industry -- were able to expand their profit margins in the third quarter of 2023 by raising their prices by roughly 10 percent each. PepsiCo's margins grew by 12 percent in the third quarter of 2023, even as the company noted that cost pressures induced by the Russia-Ukraine war had eased. Keurig Dr Pepper, the parent company of Mott's and Snapple, nearly doubled its operating margin for its U.S. non-coffee beverage segment in the third quarter of 2023 (30 percent) compared to the same quarter in 2022 (15 percent).\n\nSnacks\n\nThe CFO of Hershey, maker of Dot's Pretzels, Skinny Pop, and Pirate's Booty, said in the company's 2023 third quarter earnings call that \"pricing and productivity gains more than offset inflation and higher manufacturing and overhead costs.\" As a result, its profit margins increased by 19 percent from the same quarter in the previous year. Between the third quarters of 2022 and 2023, PepsiCo, parent company of Frito-Lay, increased profit margins by 12 percent, primarily driven by increased prices. In the second quarter of 2023, Mondelez International, maker of Oreos, Wheat Thins, and Ritz Crackers, increased its operating income by $1.15 billion from higher pricing, where higher input costs reduced operating income by just $750 million. Its profit margins increased by 75 percent between the third quarters of 2022 and 2023.\n\nPolicy Considerations to Combat the Grocery Affordability Crisis\n\nWhile the Biden administration has taken several steps to address the root causes of some recent grocery price increases, there are additional measures the administration and Congress could pursue to reduce the risk of future grocery price spikes and limit the financial harm to vulnerable families.\n\nThe Biden administration has taken a number of steps to bring down grocery prices and help American consumers.\n\nIn addition to its historic expansion of SNAP to provide more financial security to more than 40 million Americans, the Biden administration has also sought to address some of the underlying causes of recent grocery price increases:\n\nRecommendations for further action\n\nWe propose additional actions policymakers should pursue to reduce the risk of future grocery price spikes.\n\nInvestigating and potentially reforming the use of slotting fees\n\nAs the Biden administration looks to crack down on anti-consumer practices, one area worthy of additional scrutiny is slotting fees. Because retail stores have limited shelf and storage space, they often require manufacturers to \"pay to stay\" on the shelves. This storage problem is especially true in grocery stores, where many items are perishable or require specific storage (e.g., certain temperatures or types of shelving). The freezer aisle can only hold so many pints of ice cream and the chips aisle can fit only so many bags of chips.\n\nComplicating this further, large grocery retailers have private-label brands (e.g., Wal-Mart's Great Value, Kroger's Private Selection, Safeway's Signature Family), where vertical integration increases margins for retailers. While these name-brand alternatives often save consumers money, they give retailers greater power over pricing and product availability.\n\nGrocers' control over shelf space allows them to maximize the availability of high-margin products (like private labels) and auction off the rest to willing bidders. This raises prices because companies pass on slotting fees to consumers. It also makes it harder for smaller companies to compete, even if they can potentially offer products that are less expensive than their larger competitors.\n\nThe Federal Trade Commission (FTC) explored issuing guidelines for slotting fees in 2000, but ultimately never completed them. The FTC can use its section 6(b) authority to get specific information about how slotting fees are used and their potentially anticompetitive effects. If slotting fees are preventing market access for lower-price competitors or increasing market power for retailers, the FTC should reform slotting allowances.\n\nCarefully scrutinizing anticompetitive mergers throughout the food supply chain\n\nThroughout the food and agriculture industry, from fertilizer to meatpacking, monopolies reduce competition and provide an easy route for corporations to hike prices. In October 2022, Kroger and Albertsons announced a $25 billion merger deal, which, if approved by regulators, would give the resulting mega-chain nearly 17 percent of market share. In some communities, this would result in a near monopoly. More recently, Aldi announced a deal last August to acquire 400 Winn-Dixie and Harveys Supermarket locations.\n\nThe FTC has been reviewing the proposed Kroger-Albertsons $25 billion merger deal for over a year but has yet to issue a decision.\n\nWhile the companies argue that they would be able to lower prices, pay higher wages, and compete with retail giant Walmart, antitrust experts have pointed out that the merger would create a grocery monopoly in many markets. The FTC has found that grocery mergers have a high potential to increase grocery prices. Other research suggests that grocery workers stand to lose hundreds of millions of dollars and store closures could harm consumers' food access if these anticompetitive mergers are permitted and the grocery industry is further consolidated.\n\nWhile Kroger has agreed to divest certain stores, divestitures have been unsuccessful in previous grocery mergers. For example, as a condition of approving the deal, the FTC required that Albertsons sell off 170 stores when it merged with Safeway. Within months, Albertsons repurchased 33 of the divested stores after the buyer filed for bankruptcy.\n\nThe Kroger-Albertsons merger raises the risk of higher grocery prices in several communities. We urge the FTC to carefully review the merger and other pending deals that would pose similar risks.\n\nFinalizing regulations to promote competition in meatpacking\n\nIn part due to a decline in federal antitrust enforcement, concentration in meatpacking has skyrocketed over the past 40 years. Between 1980 and 2020, the market share of the largest four beef packers rose from 36 percent to 81 percent; and between 1977 and 2020, the market share of the largest four poultry processors increased from 22 to 53 percent.\n\nIn January 2022, the Biden administration released a plan to improve fairness, competition, and resiliency in meat and poultry supply chains. Included in that action plan was a commitment to strengthen the Packers and Stockyards Act, the meat industry-specific antitrust law, which was severely weakened by the Trump administration.\n\nIn October 2022, USDA proposed regulations to prohibit discrimination, retaliation, and deceptive practices in livestock and meat processing markets that weaken competition and market integrity. These rules would significantly improve the industry for farmers, ranchers, and consumers. The Biden administration should finalize them expeditiously, and complete other rules it has publicly committed to issuing under its Packers and Stockyards authority.\n\nReinstating and making food assistance expansions permanent\n\nAt the onset of the COVID-19 pandemic, Congress enacted temporary SNAP Emergency Allotments as part of the families First Coronavirus Response Act. The law gave USDA the authority to increase households' SNAP benefits to the maximum benefit for their household's size. The Biden administration expanded this policy in 2021 to reach the 40 percent of households that already received the maximum benefit, giving all households a supplement of at least $95 per month. Emergency Allotments reduced poverty by 10 percent -- and child poverty by 14 percent.\n\nIn March 2023, the Emergency Allotments lapsed as a result of Congress terminating the authority in the 2022 omnibus funding bill. Many families saw a decline in benefits. Benefits for households with children decreased, on average, $223 per month, while benefits for households with seniors decreased by an average of $168. Although cost-of-living adjustments and the Biden administration's overhaul of the Thrifty Food Plan softened the cliff when Emergency Allotments ended, SNAP benefits still fall short of fully addressing food insecurity in the U.S.\n\nCongress should expand SNAP to provide the benefits it was providing temporarily during the pandemic to ensure more families' full food needs are met.", "source": {"uri": "mronline.org", "dataType": "news", "title": "MR Online"}, "authors": [{"uri": "chen_zhang@mronline.org", "name": "Chen Zhang", "type": "author", "isAgency": false}, {"uri": "paul_burkett@mronline.org", "name": "Paul Burkett", "type": "author", "isAgency": false}], "image": "https://f3b9m7v4.rocketcdn.me/wp-content/uploads/2024/02/Grocery_store_in_Rome-62018741.jpg", "eventUri": null, "sentiment": 0.07450980392156858, "wgt": 1, "relevance": 1}, {"uri": "7988639492", "lang": "eng", "isDuplicate": false, "date": "2024-02-20", "time": "08:09:41", "dateTime": "2024-02-20T08:09:41Z", "dateTimePub": "2024-02-20T08:00:00Z", "dataType": "news", "sim": 0.7215686440467834, "url": "https://www.farmprogress.com/wheat/wheat-scoops-wheat-in-post-covid-war-era", "title": "WHEAT SCOOPS: Wheat in post-COVID, war era", "body": "There's an old saying, \"The more things change, the more they stay the same.\" This might apply to the Oklahoma/Texas, U.S., and world wheat situation. The biggest change caused by COVID and the Russian/Ukraine war may have been the price of wheat. There are signs that this price situation is getting back to normal.\n\nAfter COVID hit (2019), Oklahoma and Texas wheat prices went from just above $4 to $8 (Figure 1). After Russia invaded Ukraine (2022), Oklahoma wheat prices rose from about $8 to just over $13.\n\nThe average June 1, 2009, through Jan. 31, 2024, Pond Creek daily wheat price was $5.84. The highest price during the period of June 2009 through January 2024 was $13.13 (May 17, 2022), and the lowest price was $2.55 (Aug. 30, 2016).\n\nThe Oklahoma average monthly June 2009 through December 2023 price was $5.78, and the monthly average June, July, and August (harvest) price was $5.83. The lowest average monthly harvest price was $3.43 (2016), and the highest average monthly harvest price was $8.78 (2022).\n\nAt this writing, the Pond Creek, Okla., and the Perryton, Texas, 2024 wheat harvest forward contract price is $5.50 (KEN24 - $0.55). The 2024 wheat harvest forward contract price is about $0.30 below the average price and about $1.20 above the average February 2019 price.\n\nRelated:Richard Gaona named Southwest High Cotton winner\n\nCOVID and the war also caused higher production input prices. In February 2019, the fertilizer price index was 85. The index peaked in April 2022 at 294. The January 2024 fertilizer price index was 116.\n\nIn February 2019, the retail price of diesel ultra-low sulfur was $3 per gallon. Diesel prices peaked at $5.75 in June 2022. The 2009 through 2023 average diesel price was $3.33. The average January 2024 diesel price was $3.85.\n\nThe Russian/Ukraine war has also altered world wheat production and exports. Russia captured about 20% of Ukraine's crop land. The result is higher wheat production and exports for Russia and lower production and exports for Ukraine. The net result for Russia and Ukraine is slightly, but probably insignificant, lower production and exports. Russian 2024 wheat production is projected to be the second highest on record due to above-average yields and an increase in harvested acres.\n\nUkraine's wheat production and exports are projected to be below average this year because fewer acres were harvested due to a shortage of production inputs.\n\nThe United States' 2023/24 hard red winter (HRW) wheat stocks-to-use ratio is projected to be 48% this year compared to 33% last year and a 15-year average of 48%. The world's 2023/24 wheat stocks-to-use ratio is projected to be 33% compared to a 15-year average of 34%.\n\nRelated:Southwest responds to latest dicamba order\n\nCurrent Oklahoma and Texas wheat prices ($5.69) may be slightly below normal because Russia and Ukraine are aggressively exporting wheat stocks that were built up during the last two years. Many believe that Russia and Ukraine determine the world price of wheat.", "source": {"uri": "farmprogress.com", "dataType": "news", "title": "Farm Progress"}, "authors": [], "image": "https://eu-images.contentstack.com/v3/assets/bltdd43779342bd9107/bltec0623e0ccd00e74/63c2c6d910c1b01045ff67db/swfp-shelley-huguley-kim-anderson-header.jpg?disable=upscale&width=1200&height=630&fit=crop", "eventUri": "eng-9322632", "sentiment": -0.1372549019607843, "wgt": 1, "relevance": 1}, {"uri": "7989192294", "lang": "eng", "isDuplicate": false, "date": "2024-02-20", "time": "13:32:43", "dateTime": "2024-02-20T13:32:43Z", "dateTimePub": "2024-02-20T13:30:35Z", "dataType": "news", "sim": 0, "url": "https://www.tasnimnews.com/en/news/2024/02/20/3042416/israeli-gunboats-fire-on-palestinian-fishing-boats", "title": "Israeli Gunboats Fire on Palestinian Fishing Boats - World news - Tasnim News Agency", "body": "\"Under the Israeli blockade (before the war), Palestinians used to be able to fish up to 37km (23 miles) out to sea, but not anymore,\" said Abu Azzoum.\n\nThis threatens a vital food source in the enclave, where only limited aid trucks have been allowed in by Israel, far below the urgent needs, according to the United Nations.\n\nThe UN has warned of widespread famine-like conditions in Gaza, affecting most of the 2.3 million Palestinians living there.\n\nDesperation is growing in the Jabalia refugee camp in northern Gaza, where flour mills have stopped.\n\n\"There is no wheat. The price of one bag of wheat today has reached more than 3,000 shekels, or more than $1,000,\" said a Palestinian man operating a flour mill.\n\nIsrael, controlling entry points, has refused to allow more aid into Gaza despite international pressure, a United Nations Security Council resolution in December, and interim rulings by the International Court of Justice.\n\nIts planned ground invasion into Rafah only promises to worsen the humanitarian situation.\n\nAbout 1.4 million Palestinians are in Rafah, displaced by previous Israeli attacks, some multiple times. Hundreds have begun fleeing Rafah in the past few days as Israel remains adamant on its promise to attack despite international pressure.", "source": {"uri": "tasnimnews.com", "dataType": "news", "title": "خبرگزاری تسنیم"}, "authors": [], "image": "https://newsmedia.tasnimnews.com/Tasnim/Uploaded/Image/1402/12/01/1402120115172088629430554.jpg", "eventUri": null, "sentiment": -0.05882352941176472, "wgt": 1, "relevance": 1}, {"uri": "2024-02-262670191", "lang": "eng", "isDuplicate": false, "date": "2024-02-20", "time": "19:08:34", "dateTime": "2024-02-20T19:08:34Z", "dateTimePub": "2024-02-20T19:08:31Z", "dataType": "news", "sim": 0, "url": "https://www.industriesnews.net/news/274131914/israeli-gunboats-fire-on-palestinian-fishing-boats", "title": "Israeli Gunboats Fire on Palestinian Fishing Boats", "body": "TEHRAN (Tasnim) - Israeli gunboats have opened fire on small Palestinian boats fishing off Gaza's coast.\n\n- World news -\n\n\"Under the Israeli blockade (before the war), Palestinians used to be able to fish up to 37km (23 miles) out to sea, but not anymore,\" said Abu Azzoum.\n\nThis threatens a vital food source in the enclave, where only limited aid trucks have been allowed in by Israel, far below the urgent needs, according to the United Nations.\n\nThe UN has warned of widespread famine-like conditions in Gaza, affecting most of the 2.3 million Palestinians living there.\n\nDesperation is growing in the Jabalia refugee camp in northern Gaza, where flour mills have stopped.\n\n\"There is no wheat. The price of one bag of wheat today has reached more than 3,000 shekels, or more than $1,000,\" said a Palestinian man operating a flour mill.\n\nIsrael, controlling entry points, has refused to allow more aid into Gaza despite international pressure, a United Nations Security Council resolution in December, and interim rulings by the International Court of Justice.\n\nIts planned ground invasion into Rafah only promises to worsen the humanitarian situation.\n\nAbout 1.4 million Palestinians are in Rafah, displaced by previous Israeli attacks, some multiple times. Hundreds have begun fleeing Rafah in the past few days as Israel remains adamant on its promise to attack despite international pressure.", "source": {"uri": "industriesnews.net", "dataType": "news", "title": "industriesnews.net"}, "authors": [], "image": "https://cdn.bignewsnetwork.com/tas1708436232.jpg", "eventUri": null, "sentiment": -0.1058823529411764, "wgt": 1, "relevance": 1}, {"uri": "7990278761", "lang": "eng", "isDuplicate": false, "date": "2024-02-21", "time": "05:16:38", "dateTime": "2024-02-21T05:16:38Z", "dateTimePub": "2024-02-21T05:16:00Z", "dataType": "news", "sim": 0.5490196347236633, "url": "https://www.firstpost.com/opinion/msp-a-double-edged-sword-in-indian-agriculture-13740139.html", "title": "MSP: A double-edged sword in Indian agriculture", "body": "From tear gas to iron spikes, the government has left no stone unturned to stop the farmers' march on the Punjab-Haryana border. Thousands of farmers have been blocked on the Punjab side with an overwhelming police presence on the Haryana side. Local police and paramilitary battalions have been deployed in heavy numbers. But what lead to such a confrontation? We have to rewind to 2022, when the Modi government rescinded the three farm laws and asked the farmers to go back home as there will be a government committee formed to look into the minimum support price (MSP).\n\nSince January 2022, the government hasn't given any clear answers to the questions of MSP, debt waiver, electricity bills, etc. As 2024 began, a splinter group of the Samyukt Kisan Morcha (non-political) declared their intention to revive the demand for MSP and were willing to do a tractor-cade to Delhi on 13 February to reassert themselves and pressure the government to make MSP the legal right of farmers.\n\nNow even before we begin to analyse this demand let's understand what MSP is and how it came to be. In the 1960s, India's war with China and constant droughts devastated the Indian food distribution system. India was forced to import wheat from the US to feed its own people. But as a condition of receiving food aid, India had to agree to structural adjustment and subscribe to an industrial agricultural model. The Green Revolution experiment began in Punjab. Before interventions, Punjab was a fertile area, growing cotton, and indigenous varieties of legumes, oilseeds and millet. \"High-yielding\" rice varieties introduced during the Green Revolution were non-native and didn't suit Punjabi farmers' palate or markets, seeing as rice was not part of their diet. The Indian government pushed farmers to grow these hybrid seeds but found that there were no buyers for their rice paddy.\n\nTo address the market problem in Punjab, the Indian government introduced the MSP. Inspired by the US price support system, the MSP system assured a minimum price floor for Green Revolution crops -- mainly rice paddy and wheat. This price floor was originally calculated based on the costs of chemical inputs, seeds, and fuel, and was revised each year to assure farmers that they would earn a profit.\n\nHowever, many local traders, who had no use for the rice as it had no part in the local food economy, refused to guarantee MSP. In response, the government's Agricultural Produce Market Committee (APMC) introduced regulated market yards for buying rice and wheat, mainly in the regions where the Green Revolution was first introduced -- Punjab and Haryana. The APMC served as a safeguard for farmers, protecting them from exploitation by traders and corporations, and ensuring that farmers had a market where they would receive government-regulated prices for their produce. The farmers started to visit these APMC market yards to sell their paddy and the markets started to flourish. The grain purchased at the APMC also landed up in the PDS system and our strategic grain reserves.\n\nFor a while, the APMC system stabilised prices for farmers. Market yard taxes were used to improve village roads and other infrastructure. However, while the MSP was established to guarantee farmers a minimum price, over time it became the maximum price a farmer could hope for. To keep food inflation in check, the government didn't increase MSP to account for inflation. The cost of chemical inputs needed for the Green Revolution seeds become more costly and degraded soils, creating the need for more chemicals just to get the same yield.\n\nIf at first, a field required one kg bag of urea, after two decades of chemical farming that same field needs two or three bags of urea to get the same yield. The cost of water, farmers' labour and soil degradation were not considered in the MSP costs. MSP became an approximation of the cost of production each season by the CACP.\n\nThe CACP each year declares the MSP for 23 crops, although the government directly procures two or three crops at best.\n\n'MSP as a legal right'\n\nNow if we see the main demand of the farmers groups' - make MSP a legal right. What does it even mean? In simple terms, farmers are proposing that the government declare prices for various agri commodities each season and make purchases below them illegal.\n\nSeeing the dismaying state of agriculture and their shrinking pockets, where a farmer makes 1/10th of daily wage labourers yearly earnings, farmers wanted a guaranteed income built-in with the value of their agri-produce. Their logic is simple, if the daily wage labourer has a minimum wage for his work, the farmers should also be empowered by including the minimum living wage in the price of the produce.\n\nChallenges\n\nOn the face of it, the farmers' demand is only fair. Why shouldn't one get the fair for his labour? The Modi government has also realised this need, and hence aggressively campaigned for a doubling farmers' income programme and yet failed to see results in the past decade.\n\nThe favourite problem of the economist is food inflation, if the farmers are given a fair price then the food economy will experience hyperinflation. Of course, this could potentially be a problem, but eventually, prices will stabilise once fair prices are given. The government could eventually reduce fertilisers and other chemical agri-input subsidies, providing relief to the taxpayers too.\n\nIn a second scenario from last year, 2023 was one of the worst years for food inflation with hyperinflation in vegetables, wheat, etc. while the farmers got less than Rs 2/kg for their tomatoes. There was a huge gap in what the farmers got and what the consumers paid. Compare over 220/kg paid by people in metro cities while the farmers got under 5/kg for tomatoes. The key lesson is supply management, prices can be managed with better supply management. If most resources are spent improving supply management, the farmers, traders and consumers can all get a portion of food at fair prices. Oversupply at harvest time, without inadequate storage facilities, is leading to price volatility.\n\nThe Green Revolution also started spreading to other areas in India but the APMC market yards did not. Farmers in these newer areas got higher yields but no market to sell. This led to an over-supply of cereals like rice and wheat, while indigenous crops like oilseeds and legumes declined rapidly. Most of the paddy and wheat varieties are grown strictly for the market, not for farmers themselves. Traders took advantage of this over-supply and started to manipulate farmers and decrease prices. Most Indian farmers are small-scale farmers, owning less than two acres, and lacking grain storage facilities. They are forced to sell their crops to local traders as soon as they harvest or risk losing their harvest altogether -- another vulnerability that traders tend to take advantage of.\n\nThe Green Revolution has transformed Indian agriculture. While it made India cereal sovereign, Indians got more than they bargained for -- monocultures, shortage of oilseeds, disappearance of trace minerals from diets, the emergence of diseases like cancer. And all these came hand in hand with MSP -- all part of the industrial system of agriculture. Even now, after the laws are repealed, the farmers hope that with a law on MSP, they will be lifted out of the agrarian crisis.\n\nBut the MSP system itself has trapped farmers in the wheat/rice paddy growing cycle. As irrigation use is increasing, even dryland farmers are abandoning indigenous, locally adapted crops for wheat and rice. MSP is plugging more farmers into the industrial agriculture system and the consequent oversupply of agricultural commodities is crashing prices. Heavy government subsidies that support the fertiliser and oil industry are also draining the Indian economy.\n\nSo in many ways, the current situation is a catch-22. Without MSP, farmers can't survive economically. But by growing MSP crops like wheat and rice, they destroy land, water, and soil and get exploited by the industrial market system. If MSP is not diverted towards agroecological farming, MSP backing an industrial system of agriculture could potentially be risky. Farmers and the government should reimagine MSP to serve national and environmental interests not just market ones.", "source": {"uri": "firstpost.com", "dataType": "news", "title": "Firstpost"}, "authors": [], "image": "https://images.firstpost.com/uploads/2024/02/FarmerStrike1200PTI-2024-02-f09ecb87fd80c940a99424db18464cb2.jpg?im=FitAndFill=(1200,675)", "eventUri": "eng-9319201", "sentiment": -0.2705882352941177, "wgt": 1, "relevance": 1}, {"uri": "7960858782", "lang": "eng", "isDuplicate": false, "date": "2024-02-02", "time": "04:13:56", "dateTime": "2024-02-02T04:13:56Z", "dateTimePub": "2024-02-02T04:13:36Z", "dataType": "news", "sim": 0.686274528503418, "url": "https://www.aninews.in/news/world/asia/gilgit-baltistan-economic-coordination-committee-approves-wheat-subsidy-trims-ministries-budgets-after-protests20240202094322/", "title": "Gilgit Baltistan: Economic Coordination Committee approves wheat subsidy, trims ministries' budgets after protests", "body": "Gilgit Baltistan [PoK], February 2 (ANI): After a month-long struggle and protests in Gilgit Baltistan over a wheat price hike, the Economic Coordination Committee (ECC) of the interim cabinet agreed to continue providing subsidies to the people of the region by slashing budgets of some major ministries given strict International Monetary Fund (IMF) conditions on subsidies, Dawn News reported.\n\nThe decision was taken during the meeting presided over by caretaker Finance Minister Shamshad Akhtar, who approved the transition from the London Inter-Bank Offer Rate (Libor) to the Secured Over Night Financing Rate (SOFR) in electricity contracts.\n\nPakistan's daily publication reported that the meeting discussed the issue of a sustainable plan for the price rationalisation of subsidised wheat in Gilgit-Baltistan. The people of the region have been protesting over the price increase for almost a month as the federal government scaled down the wheat subsidy.\n\nThe Gilgit Baltistan government had an understanding with the federal government to gradually increase the wheat price to Pakistan Rupee (PKR) 52 per kg to adjust the subsidy impact, but when it increased the rates to PKR 36 per kg from about PKR 20 per kg, protests erupted in the entire region. The withdrawal of full subsidy would mean an additional burden of more than Rs10bn on the GB government, which, in any case, relies on federal financing to run its affairs.\n\nThe Ministry of Finance explained that it could not extend subsidy out of budget due to strict IMF conditions. The only option was to make technical supplementary grants by diverting funds from other ministries having large part portfolios.\n\nThe ECC also approved a summary of the Ministry of Power regarding transition to the SOFR for interest calculation from Libor, which came to an end on June 30 last year in the international financial market. Under a decision of the UK's Financial Conduct Authority, the Libor system of benchmarking financial transactions has already expired on June 30 and replaced with the SOFR system with the approval of the Federal Reserve's Alternative Reference Rate Committee (ARRC), Dawn News reported.\n\nThe Power Division had contracts with foreign private contractors that required to transition to the new system, but Chinese investors had some reservations. The Power Division had proposed that project lenders of independent power producers and independent transmission companies should be allowed to adopt SOFR as a replacement for USD Libor on the basis of term SOFR plus applicable CAS and daily SOFR plus applicable CAS.\n\nThe meeting approved a series of supplementary grants. For example, it approved a supplementary grant of Rs38.856 million for Institutional Reforms Cell from the Cabinet Division and for import of Sahiwal Bull from Pakistan as semen donors for National Artificial Insemination Programme from the Ministry of Commerce.\n\nThe ECC approved a PKR 1.59 billion supplementary grant to the Ministry of Finance for rehabilitation of flood damaged rural roads in Khyber Pakhtunkhwa through counter value fund deposited under Japanese grant aid, and provision of clean drinking water in Model Areas UC 99, 100 and 101 Lahore through counter value fund deposited under Japanese grant aid. (ANI)", "source": {"uri": "aninews.in", "dataType": "news", "title": "Asian News International (ANI)"}, "authors": [], "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20240202035830.jpg", "eventUri": "eng-9269791", "sentiment": -0.03529411764705881, "wgt": 34, "relevance": 34}, {"uri": "7960876820", "lang": "eng", "isDuplicate": false, "date": "2024-02-02", "time": "04:36:42", "dateTime": "2024-02-02T04:36:42Z", "dateTimePub": "2024-02-02T04:20:19Z", "dataType": "news", "sim": 0.7843137383460999, "url": "https://www.latestly.com/agency-news/world-news-gilgit-baltistan-economic-coordination-committee-approves-wheat-subsidy-trims-ministries-budgets-after-protests-5732798.html", "title": "World News | Gilgit Baltistan: Economic Coordination Committee Approves Wheat Subsidy, Trims Ministries' Budgets After Protests | LatestLY", "body": "Gilgit Baltistan [PoK], February 2 (ANI): After a month-long struggle and protests in Gilgit Baltistan over a wheat price hike, the Economic Coordination Committee (ECC) of the interim cabinet agreed to continue providing subsidies to the people of the region by slashing budgets of some major ministries given strict International Monetary Fund (IMF) conditions on subsidies, Dawn News reported.\n\nThe decision was taken during the meeting presided over by caretaker Finance Minister Shamshad Akhtar, who approved the transition from the London Inter-Bank Offer Rate (Libor) to the Secured Over Night Financing Rate (SOFR) in electricity contracts.\n\nAlso Read | India and China Accounting for Most of the Upward Revision, Asia on Track To Again Deliver Two-Thirds to Global Growth in 2024, Says IMF.\n\nPakistan's daily publication reported that the meeting discussed the issue of a sustainable plan for the price rationalisation of subsidised wheat in Gilgit-Baltistan. The people of the region have been protesting over the price increase for almost a month as the federal government scaled down the wheat subsidy.\n\nThe Gilgit Baltistan government had an understanding with the federal government to gradually increase the wheat price to Pakistan Rupee (PKR) 52 per kg to adjust the subsidy impact, but when it increased the rates to PKR 36 per kg from about PKR 20 per kg, protests erupted in the entire region. The withdrawal of full subsidy would mean an additional burden of more than Rs10bn on the GB government, which, in any case, relies on federal financing to run its affairs.\n\nAlso Read | Fire Breaks Out in Mumbai's Chembur Due to Cylinder Blast, Nine Injured: Live Breaking News Headlines & Updates, February 2, 2024.\n\nThe Ministry of Finance explained that it could not extend subsidy out of budget due to strict IMF conditions. The only option was to make technical supplementary grants by diverting funds from other ministries having large part portfolios.\n\nThe ECC also approved a summary of the Ministry of Power regarding transition to the SOFR for interest calculation from Libor, which came to an end on June 30 last year in the international financial market. Under a decision of the UK's Financial Conduct Authority, the Libor system of benchmarking financial transactions has already expired on June 30 and replaced with the SOFR system with the approval of the Federal Reserve's Alternative Reference Rate Committee (ARRC), Dawn News reported.\n\nThe Power Division had contracts with foreign private contractors that required to transition to the new system, but Chinese investors had some reservations. The Power Division had proposed that project lenders of independent power producers and independent transmission companies should be allowed to adopt SOFR as a replacement for USD Libor on the basis of term SOFR plus applicable CAS and daily SOFR plus applicable CAS.\n\nThe meeting approved a series of supplementary grants. For example, it approved a supplementary grant of Rs38.856 million for Institutional Reforms Cell from the Cabinet Division and for import of Sahiwal Bull from Pakistan as semen donors for National Artificial Insemination Programme from the Ministry of Commerce.\n\nThe ECC approved a PKR 1.59 billion supplementary grant to the Ministry of Finance for rehabilitation of flood damaged rural roads in Khyber Pakhtunkhwa through counter value fund deposited under Japanese grant aid, and provision of clean drinking water in Model Areas UC 99, 100 and 101 Lahore through counter value fund deposited under Japanese grant aid. (ANI)\n\n(This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "eventUri": "eng-9269791", "sentiment": 0.03529411764705892, "wgt": 34, "relevance": 34}, {"uri": "7961539109", "lang": "eng", "isDuplicate": false, "date": "2024-02-02", "time": "13:05:52", "dateTime": "2024-02-02T13:05:52Z", "dateTimePub": "2024-02-02T12:57:11Z", "dataType": "news", "sim": 0.8235294222831726, "url": "https://www.suchtv.pk/business/item/124238-ecc-approves-gb-wheat-subsidy-trims-ministries-budgets.html", "title": "ECC approves GB wheat subsidy, trims ministries' budgets - SUCH TV", "body": "Amid continuous unrest in Gilgit-Baltistan for almost a month over a wheat price hike, the Economic Coordination Committee (ECC) of the Cabinet on Thursday agreed to continue providing subsidy to the people of the region by slashing budgets of some major ministries in view of strict IMF conditions on subsidies.\n\nThe meeting, presided over by caretaker Finance Minister Dr Shamshad Akhtar, also approved the transition from the London Inter-Bank Offer Rate (Libor) to Secured Over Night Financing Rate (SOFR) in electricity contracts.\n\nThe meeting discussed the issue of a sustainable plan for the price rationalisation of subsidised wheat in Gilgit-Baltistan. The people of the region have been protesting over the price increase for almost a month as the federal government scaled down wheat subsidy.\n\nThe GB government had an understanding with the federal government to gradually increase the wheat price to Rs52 per kg to adjust the subsidy impact, but when it increased the rates to Rs36 per kg from about Rs20 per kg, protests erupted in the entire region. The withdrawal of full subsidy would mean an additional burden of more than Rs10bn on the GB government, which, in any case, relies on federal financing to run its affairs.\n\nThe Ministry of Finance explained that it could not extend subsidy out of budget due to strict IMF conditions. The only option was to make technical supplementary grants by diverting funds from other ministries having large part portfolios.\n\nThe ECC also approved a summary of the Ministry of Power regarding transition to the SOFR for interest calculation from Libor, which came to an end on June 30 last year in the international financial market. Under a decision of the UK's Financial Conduct Authority, the Libor system of benchmarking financial transactions has already expired on June 30 and replaced with the SOFR system with the approval of the Federal Reserve's Alternative Reference Rate Committee (ARRC).\n\nThe Power Division had contracts with foreign private contractors that required to transition to the new system, but Chinese investors had some reservations. The Power Division had proposed that project lenders of independent power producers and independent transmission companies should be allowed to adopt SOFR as a replacement for USD Libor on the basis of term SOFR plus applicable CAS and daily SOFR plus applicable CAS.\n\nThe meeting approved a series of supplementary grants. For example, it approved a supplementary grant of Rs38.856 million for Institutional Reforms Cell from the Cabinet Division and for import of Sahiwal Bull from Pakistan as semen donors for National Artificial Insemination Programme from the Ministry of Commerce.\n\nThe ECC approved a Rs1.59bn supplementary grant to the Ministry of Finance for rehabilitation of flood damaged rural roads in Khyber Pakhtunkhwa through counter value fund deposited under Japanese grant aid, and provision of clean drinking water in Model Areas UC 99, 100 and 101 Lahore through counter value fund deposited under Japanese grant aid.", "source": {"uri": "suchtv.pk", "dataType": "news", "title": "SUCH TV"}, "authors": [], "image": "https://www.suchtv.pk/media/k2/items/cache/d6223075b399aacc7ff5a0efc7edd86a_XL.jpg", "eventUri": "eng-9269791", "sentiment": 0.0980392156862746, "wgt": 34, "relevance": 34}, {"uri": "7964263884", "lang": "eng", "isDuplicate": false, "date": "2024-02-04", "time": "17:33:03", "dateTime": "2024-02-04T17:33:03Z", "dateTimePub": "2024-02-04T17:31:50Z", "dataType": "news", "sim": 0.6392157077789307, "url": "https://www.aninews.in/news/world/asia/gilgit-baltistan-millat-jafaria-leader-urges-people-organisations-to-fully-participate-in-sit-in-to-protest-against-wheat-price-hike20240204225108/", "title": "Gilgit Baltistan: Millat Jafaria leader urges people, organisations to fully participate in sit-in to protest against wheat price hike", "body": "Gilgit Baltistan [PoK], February 4 (ANI): Millat Jafaria Gilgit-Baltistan leader Agha Syed Rahat Hussain Al-Husseini urged the people of Gilgit-Baltistan, organisations, and associations to fully participate in the sit-ins organised to stand for demands related to the wheat price hike, as reported by Pakistan vernacular media, the Daily K2.\n\nWhile addressing the gathering on Friday in Gilgit-Baltitstan, he said that he salutes the people of the region who have been protesting for their rights for many days in the bitter cold weather.\n\n\"I would request that the people of Gilgit-Baltistan, organisations, associations and people involved in various committees fully participate in the sit-ins and cooperate with the organisers,\" he said.\n\nMoreover, Al-Husseini said that the Pakistan government should negotiate with the leaders of the Awami Action Committee and find a solution to their problems.\n\nHe further added that, otherwise, they should resign and join the sit-in with them, according to Daily K2.\n\nAl-Husseini highlighted that, if needed, he will participate in the sit-in.\n\nThe Leader of Millat Jafaria said that the Charter of Demand of the Awami Action Committee is the voice of the heart of every individual in Gilgit-Baltistan for which serious steps are needed to be taken.\n\nFurthermore, he emphasised that the people of Nagar and Baltistan have solved the wheat problem through protests and the people of Gilgit also have to come out to fulfil their remaining demands, Daily K2 reported.\n\nThe leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThese demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB.\n\nNotably, after a month-long struggle and protests in Gilgit Baltistan over a wheat price hike, the Economic Coordination Committee (ECC) of the interim cabinet agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries given strict International Monetary Fund (IMF) conditions on subsidies, Dawn News reported. (ANI)", "source": {"uri": "aninews.in", "dataType": "news", "title": "Asian News International (ANI)"}, "authors": [], "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20240204125757.jpg", "eventUri": "eng-9270131", "sentiment": -0.1764705882352942, "wgt": 34, "relevance": 34}, {"uri": "7964278948", "lang": "eng", "isDuplicate": false, "date": "2024-02-04", "time": "17:50:19", "dateTime": "2024-02-04T17:50:19Z", "dateTimePub": "2024-02-04T17:36:25Z", "dataType": "news", "sim": 0.7921568751335144, "url": "https://www.latestly.com/agency-news/world-news-gilgit-baltistan-millat-jafaria-leader-urges-people-organisations-to-fully-participate-in-sit-in-to-protest-against-wheat-price-hike-5737901.html", "title": "World News | Gilgit Baltistan: Millat Jafaria Leader Urges People, Organisations to Fully Participate in Sit-in to Protest Against Wheat Price Hike | LatestLY", "body": "Gilgit Baltistan [PoK], February 4 (ANI): Millat Jafaria Gilgit-Baltistan leader Agha Syed Rahat Hussain Al-Husseini urged the people of Gilgit-Baltistan, organisations, and associations to fully participate in the sit-ins organised to stand for demands related to the wheat price hike, as reported by Pakistan vernacular media, the Daily K2.\n\nWhile addressing the gathering on Friday in Gilgit-Baltitstan, he said that he salutes the people of the region who have been protesting for their rights for many days in the bitter cold weather.\n\nAlso Read | Sri Lanka National Day 2024 Date: Know History and Significance Related to the Day When the Country Attained Independence.\n\n\"I would request that the people of Gilgit-Baltistan, organisations, associations and people involved in various committees fully participate in the sit-ins and cooperate with the organisers,\" he said.\n\nMoreover, Al-Husseini said that the Pakistan government should negotiate with the leaders of the Awami Action Committee and find a solution to their problems.\n\nAlso Read | Israel Attacks Hezbollah: Israeli Defence Forces Acknowledges Air Strikes in Syria.\n\nHe further added that, otherwise, they should resign and join the sit-in with them, according to Daily K2.\n\nAl-Husseini highlighted that, if needed, he will participate in the sit-in.\n\nThe Leader of Millat Jafaria said that the Charter of Demand of the Awami Action Committee is the voice of the heart of every individual in Gilgit-Baltistan for which serious steps are needed to be taken.\n\nFurthermore, he emphasised that the people of Nagar and Baltistan have solved the wheat problem through protests and the people of Gilgit also have to come out to fulfil their remaining demands, Daily K2 reported.\n\nThe leaders of the Awami Action Committee (AAC) on Friday declared specific demands for the provincial government of Gilgit Baltistan.\n\nThese demands from the leaders of AAC have come to light when the area has been witnessing several protests against the provincial administration.\n\nThe leaders of the AAC while speaking on the demands said that \"our first demand from the administration is that they give us a guarantee that they will not revoke the wheat subsidy in the future\".\n\nThe leaders have also demanded the reinstatement of the health card, a subsidised health benefits card that was given to the people of Pakistan-Occupied Kashmir (PoK) and was revoked from GB some time back.\n\nThe leaders also demanded that the Finance Act of Pakistan must be revoked, because of this act, the revenue generated from the intensive use of natural resources of GB is not being given to the people of GB.\n\nNotably, after a month-long struggle and protests in Gilgit Baltistan over a wheat price hike, the Economic Coordination Committee (ECC) of the interim cabinet agreed to continue providing subsidies to the people of the region by slashing the budgets of some major ministries given strict International Monetary Fund (IMF) conditions on subsidies, Dawn News reported. (ANI)", "source": {"uri": "latestly.com", "dataType": "news", "title": "LatestLY"}, "authors": [], "image": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "eventUri": "eng-9270131", "sentiment": -0.1529411764705882, "wgt": 34, "relevance": 34}, {"uri": "7987546102", "lang": "eng", "isDuplicate": false, "date": "2024-02-19", "time": "15:06:27", "dateTime": "2024-02-19T15:06:27Z", "dateTimePub": "2024-02-19T15:00:02Z", "dataType": "news", "sim": 0.7019608020782471, "url": "https://www.farmersweekly.co.za/opinion/blog/letter-from-the-editor/why-is-the-wheat-price-still-relatively-low/", "title": "Why is the wheat price still relatively low?", "body": "Russia invaded Ukraine in February 2022, and while I was looking into the most recent developments on the Russia-Ukraine front, I read Newswise's report on a new study, 'Impacts of the Russian invasion of Ukraine on the global wheat market', by the University of Illinois Urbana-Champaign and Texas Tech University, which focuses particularly on how the Russia-Ukraine war has impacted wheat trade.\n\nFollowing Russia's invasion of Ukraine in 2022, we saw an immediate impact on the trade of wheat, with prices soaring 28%.\n\nWithin a few months, the price of wheat began to drop, and while significantly lower than during the early phase of the war, the wheat price is still 2% to 3% higher now compared with the pre-war figures.\n\nAnd while this is not a significant increase, the impact of such an increase remains severe for many developing countries.\n\nNewswise points out that while wheat is grown in 97 countries across the world, countries such as China and India produce wheat primarily for their own consumption.\n\nThis means that the pool of countries that export wheat is relatively small, and removing a major player from the equation has a dire impact on poor countries.\n\nThis is particularly true for countries in which the cost of living is exorbitant already. Africa, Asia and the Middle East are the world's biggest importers, and this is also where the majority of the world's poorest countries are located.\n\nThe Black Sea Grain Initiative was established in the early phases of the war to allow for safe passage of Ukrainian grain across the Black Sea, which may account for the drop in wheat prices from its peak at the start of the war.\n\nHowever, as Farmer's Weekly previously reported, this deal has now expired, with Russia refusing to renew the agreement. Despite this, the wheat price has not increased significantly, despite the deal having expired in July 2023.\n\nThis poses an interesting question: why did the price not increase, considering Ukraine's important role in the production of wheat? The answer to this question, of course, is that other wheat-exporting countries have increased production, filling the gap left by Ukraine.\n\nWhile the study doesn't highlight this point, it does reveal that sanctions do not help in any significant manner. The US and its allies may have sanctioned Russia, but Russia has taken the opportunity to exploit the global demand for wheat and is profiting from this demand at the expense of Ukraine.\n\nPerhaps this is one of the reasons why Russia is adamantly against renewing the Black Sea Grain Initiative.\n\nOther countries are also profiting from this, and it leaves global leaders and decision makers in a difficult position: while many want to support Ukraine, it cannot chastise countries that have exploited the Russia-Ukraine war, because this means further burdening those countries that rely on affordable wheat exports.\n\nI'm not sure what the solution to this problem is, but it would seem that countries are so intertwined that we may just be living in a house of cards, and all it takes is one major event to send it all toppling down", "source": {"uri": "farmersweekly.co.za", "dataType": "news", "title": "Farmer's Weekly"}, "authors": [{"uri": "janine_ryan@farmersweekly.co.za", "name": "Janine Ryan", "type": "author", "isAgency": false}], "image": "https://www.farmersweekly.co.za/app/uploads/2024/02/wheat_Wikimedia.jpg", "eventUri": "eng-9322632", "sentiment": -0.388235294117647, "wgt": 34, "relevance": 34}, {"uri": "7966605114", "lang": "eng", "isDuplicate": false, "date": "2024-02-06", "time": "08:04:47", "dateTime": "2024-02-06T08:04:47Z", "dateTimePub": "2024-02-06T08:00:00Z", "dataType": "news", "sim": 0.5254902243614197, "url": "https://www.farmprogress.com/wheat/wheat-scoops-potential-2024-wheat-harvest-prices-", "title": "WHEAT SCOOPS: Potential 2024 wheat harvest prices", "body": "The quality and quantity of Oklahoma and Texas wheat will play a significant role.\n\nAt this writing, wheat may be forward contracted for 2024 harvest delivery in Pond Creek, Okla., and Perryton, Texas for $5.60 (-$0.55 KEN '24). The 2024 wheat harvest price in Altus, Okla., is $5.30 (-$0.85 KEN '24). These forward contract prices may be the best predictors of the 2024 wheat harvest prices for Pond Creek, Perryton, and Altus.\n\nA caveat is that the market normally puts a 10- to 15-cent risk factor in wheat forward contract prices. Using a 10-cent risk factor produces an average harvest price estimate of $5.70 for Pond Creek and Perryton.\n\nThe one thing known with a large degree of certainty about the 2024 wheat harvest price is that the Pond Creek, Perryton, and Altus prices will not be $5.70 or $5.40.\n\nAnother prediction of 2024 average wheat harvest price may be produced by calculating the change in prices between the average January wheat price and the average harvest price within the same calendar year.\n\nTable 1 shows the average January daily prices and the average harvest prices for the January 2009 through January 2024 period for Pond Creek and Perryton (Table 1). The average wheat harvest prices are the average of June, July, and August daily wheat prices for each marketing year.\n\nFor Pond Creek and Perryton, the average January (2009 through 2023) daily wheat price was $5.65. The average change between January and harvest is $0.05, which implies an expected 2024 average harvest wheat price of $5.70. This is nearly the same as the current forward contract price.\n\nRelated:CattleCon24: NCBA Orlando roundup\n\nFor the eight years of declining prices (January to harvest), the average price decline was $0.63. For the seven years of higher prices, the average price increase was $0.83. This implies a potential average harvest price range of $5.07 ($5.70 - $0.63) to $6.53 ($5.70 - $0.83). Only 50% of the time will prices be in this range.\n\nThe largest price decline was $0.93, which implies an average harvest price floor of $4.77 ($5.70 - $0.93). The largest price increase was $1.57, which implies a price ceiling of $7.27 $5.70 + $1.57). Given the volatility in the current wheat market, a price range of $4.77 to $7.27 for the 2024 Oklahoma and Texas wheat harvest is probably realistic.\n\nThe average price range (highest daily price minus the lowest daily price within each harvest) for the 2009 through 2023 harvests was $1.83. This implies that, if the 2024 average harvest price is $5.70, on average the prices could be as low as $4.78 ($5.70 - $0.92) or as high as $6.62 ($5.70 + $0.92) during the harvest period.\n\nRelated:2024 wheat prices speculated to be lower than '23\n\nThe largest price ranges within the harvest periods (June through August) were $3.42 (2022), $3.12 (2010), and $3.04 (2012). The lowest price ranges were $0.78 (2013), $0.97 (2019) and $0.80 (2020). These rangers show the price uncertainty within any given harvest period.\n\nWe know that the market situation will change between now and the 2024 wheat harvest. The above analysis shows that actual prices are uncertain.\n\nMore important than price may be the quantity and quality of the Oklahoma and Texas 2024 wheat harvest. Producers control soil fertility, which helps determine the quality. Mother Nature will be the major determinate of quantity and, to some extent, quality.", "source": {"uri": "farmprogress.com", "dataType": "news", "title": "Farm Progress"}, "authors": [], "image": "https://eu-images.contentstack.com/v3/assets/bltdd43779342bd9107/bltec0623e0ccd00e74/63c2c6d910c1b01045ff67db/swfp-shelley-huguley-kim-anderson-header.jpg?disable=upscale&width=1200&height=630&fit=crop", "eventUri": "eng-9277978", "sentiment": 0.08235294117647052, "wgt": 67, "relevance": 67}]}}